{"query": "artificial intelligence", "id": "40415121", "url": "https://pubmed.ncbi.nlm.nih.gov/40415121/", "title": "Advancing e-waste classification with customizable YOLO based deep learning models.", "summary": "The burgeoning problem of electronic waste (e-waste) management necessitates sophisticated, efficient, and precise classification techniques for recycling and repurposing. To address these critical environmental and health implications, this research delves into a comprehensive analysis of three cutting-edge object detection models: YOLOv5, YOLOv7, and YOLOv8. These models are examined through the lens of efficient e-waste classification, a pivotal step in recycling and repurposing efforts. The 'You Only Look Once' (YOLO) methodology underpins our research, highlighting the distinctive architectural features of each model, including the CSPDarknet53 backbone, PANet, and advanced anchor-free detection. This research approach involved the creation of a specialized image dataset encompassing seven distinct e-waste categories to facilitate the training and validation of these models. The performance of improved and customizable YOLOv5, YOLOv7, and YOLOv8 was meticulously evaluated across various parameters such as precision, recall, speed, and training efficiency. This evaluation explores the architectural nuances of each model and its efficacy in accurately detecting diverse e-waste components. The standout performer, YOLOv8, demonstrated exceptional capabilities with its enhanced feature pyramid networks and improved CSPDarknet53 backbone with 53 convolutional layers, achieving superior precision and accuracy. Notably, this model showcased a significant reduction in training time while leveraging the computational power of the Tesla T4 GPU on Google Colab. However, the research also identified challenges, particularly in object orientation detection, suggesting avenues for future refinement. This study underscores the vital role of advanced YOLO architectures in e-waste management, providing critical insights into their practical viability, applicability in real-world scenarios, and potential limitations. By setting a benchmark in real-time object detection, our work paves the way for future innovations and improvements in environmental management technologies, specifically tailored to meet the escalating challenge of e-waste management.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "利用可客製化YOLO深度學習模型提升電子廢棄物分類", "summary_zh": "電子廢棄物日益嚴重的問題，需要更精密、高效和準確的分類技術來進行回收和再利用。本研究深入分析了YOLOv5、YOLOv7和YOLOv8三種先進的物件偵測模型，用於高效的電子廢棄物分類。研究創建了一個包含七種不同電子廢棄物類別的專用圖像數據集，用於訓練和驗證這些模型。評估了各模型的精確度、召回率、速度和訓練效率等參數。YOLOv8表現最為出色，具有增強的特徵金字塔網絡和改良的CSPDarknet53主幹，展現了卓越的精確度和準確性，並顯著縮短了訓練時間。本研究強調了先進YOLO架構在電子廢棄物管理中的重要作用，並為未來的環境管理技術創新奠定了基礎。", "applications": ["想像一下，以後回收場可以利用AI快速分辨不同種類的電子垃圾，像是手機、電腦、還是電線，這樣就能更有效率地拆解和回收有用的材料，減少環境污染。", "如果我們在工廠裡導入這項技術，就能自動檢測生產線上是否有瑕疵的電子零件，及早發現問題，避免浪費資源，提升產品品質。", "未來海關可以使用這個AI系統來檢查進口的貨物，快速辨識裡面是否夾帶了違禁的電子廢棄物，防止非法傾倒，保護我們的環境。"], "audio": "audios/40415121.mp3", "timestamp": "2025-05-26T17:24:25.138345"}
{"query": "machine learning", "id": "40415143", "url": "https://pubmed.ncbi.nlm.nih.gov/40415143/", "title": "Development and validation of a predictive model for refracture risk in elderly individuals with osteoporotic vertebral compression fracture: a retrospective study in China.", "summary": "BACKGROUND: The rising incidence of refractures and associated adverse outcomes among individuals with osteoporotic vertebral compression fractures has gained significant attention. Identifying refracture risk is crucial for implementing effective preventive strategies. This study aimed to develop a predictive model for assessing the risk of refracture following an initial vertebral fragility fracture.\nMETHODS: The study included both men and women, focusing on individuals aged 60 and above. The fractures were diagnosed using X-rays. Participants from three centers were used for model development, while the fourth center was used for validation. The discrimination and calibration of each model was assessed using the validation set. A predictive model for preoperative refracture risk was developed using logistic regression analysis and visualized via a nomogram.\nRESULTS: A total of 1,632 participants with a median age of 72 years were enrolled, of whom 428 had experienced a refracture. Eleven factors were identified as significant predictors of refracture: age, rehabilitation status, treatment regimen, alcohol consumption, body mass index (BMI), duration of medication use, history of comorbidities, fall risk, and levels of bone gla protein (BGP), total alkaline phosphatase (TALP), and homocysteine (Hcy). The average AUC of the nomogram was 0.936 (0.92-0.952) in the training set and 0.922 (0.894-0.949) in the validation set. The values for sensitivity, specificity, and accuracy were 0.825, 0.908, and 0.885, respectively.\nCONCLUSION: Eleven independent risk factors for refracture were identified and incorporated into a nomogram, which was subsequently converted into an online calculator. This tool can be used to evaluate the risk of refracture in individuals with initial fragility fractures, showing the potential to inform clinical decision-making and optimize patient management. The global applicability of the developed tool still needs to be tested and calibrated by including diverse populations, as this study only included Chinese participants during the tool development phase.\nCLINICAL REGISTRATION NUMBER: Not applicable.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "骨質疏鬆性椎體壓縮性骨折老年患者再骨折風險預測模型的開發與驗證：一項中國回顧性研究", "summary_zh": "這項研究旨在開發一個預測模型，評估老年人在首次發生骨質疏鬆性椎體壓縮性骨折後再次骨折的風險。研究納入了1632名60歲以上的參與者，並分析了11個顯著的再骨折預測因子，包括年齡、復健狀況、治療方案、飲酒、身體質量指數、用藥時間、合併症病史、跌倒風險以及骨鈣素、總鹼性磷酸酶和同型半胱氨酸的水平。研究人員利用這些因子建立了一個列線圖，並將其轉換為線上計算器。該模型在驗證集中表現出良好的區分度和校準度，可用於評估患者的再骨折風險，從而協助臨床決策並優化患者管理。但由於該工具的開發階段僅納入中國參與者，其全球適用性仍需通過納入不同人群進行測試和校準。", "applications": ["【長輩跌倒風險評估】家裡長輩之前不小心骨折過，現在可以透過這個線上計算機，輸入一些基本資料，就能快速評估他們再次骨折的風險，讓我們能更注意他們的居家安全，像是加裝扶手、改善照明等等。", "【骨質疏鬆治療效果追蹤】如果長輩正在接受骨質疏鬆的治療，我們可以定期用這個工具評估他們的再骨折風險變化。如果風險沒有明顯下降，就表示可能需要調整治療方案，才能更有效地預防骨折。", "【社區關懷據點健康講座】在社區活動中，我們可以利用這個研究結果，向長者宣導骨質疏鬆和預防骨折的重要性。透過簡單易懂的說明，讓他們了解哪些因素會增加骨折風險，並鼓勵他們主動尋求醫療協助。"], "audio": "audios/40415143.mp3", "timestamp": "2025-05-26T17:24:37.274748"}
{"query": "deep learning", "id": "40415151", "url": "https://pubmed.ncbi.nlm.nih.gov/40415151/", "title": "Automated landmark-based mid-sagittal plane: reliability for 3-dimensional mandibular asymmetry assessment on head CT scans.", "summary": "OBJECTIVE: The determination of the mid-sagittal plane (MSP) on three-dimensional (3D) head imaging is key to the assessment of facial asymmetry. The aim of this study was to evaluate the reliability of an automated landmark-based MSP to quantify mandibular asymmetry on head computed tomography (CT) scans.\nMATERIALS AND METHODS: A dataset of 368 CT scans, including orthognathic surgery patients, was automatically annotated with 3D cephalometric landmarks via a previously published deep learning-based method. Five of these landmarks were used to automatically construct an MSP orthogonal to the Frankfurt horizontal plane. The reliability of automatic MSP construction was compared with the reliability of manual MSP construction based on 6 manual localizations by 3 experienced operators on 19 randomly selected CT scans. The mandibular asymmetry of the 368 CT scans with respect to the MSP was calculated and compared with clinical expert judgment.\nRESULTS: The construction of the MSP was found to be highly reliable, both manually and automatically. The manual reproducibility 95% limit of agreement was less than 1 mm for -y translation and less than 1.1° for -x and -z rotation, and the automatic measurement lied within the confidence interval of the manual method. The automatic MSP construction was shown to be clinically relevant, with the mandibular asymmetry measures being consistent with the expertly assessed levels of asymmetry.\nCONCLUSION: The proposed automatic landmark-based MSP construction was found to be as reliable as manual construction and clinically relevant in assessing the mandibular asymmetry of 368 head CT scans.\nCLINICAL RELEVANCE: Once implemented in a clinical software, fully automated landmark-based MSP construction could be clinically used to assess mandibular asymmetry on head CT scans.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "基於自動化地標的中矢狀面：用於頭部CT掃描中三維下頜不對稱評估的可靠性", "summary_zh": "本研究旨在評估一種基於自動化地標的中矢狀面(MSP)在量化頭部電腦斷層掃描(CT)下頜不對稱方面的可靠性。研究使用包含正頜手術患者的368個CT掃描數據集，通過深度學習方法自動標註3D頭影測量地標。其中五個地標用於自動構建垂直於法蘭克福水平面的MSP。結果表明，自動和手動MSP構建均具有高度可靠性，且自動MSP構建在臨床上具有相關性，下頜不對稱測量結果與專家評估的不對稱程度一致。結論是，所提出的基於自動化地標的MSP構建與手動構建一樣可靠，並且在評估368個頭部CT掃描的下頜不對稱方面具有臨床意義。此技術未來可應用於臨床軟體，以評估下頜不對稱。", "applications": ["想像一下，未來牙醫或整形外科醫生在評估臉部歪斜程度時，不再需要手動測量，電腦可以自動判斷，大幅縮短評估時間，讓醫生可以更專注於治療計畫。", "如果小朋友的臉部發育不對稱，透過這個技術可以及早發現問題，及早介入矯正，避免影響未來的臉部外觀和功能。", "車禍或意外事故造成臉部骨骼受傷，這個技術可以幫助醫生更精準地重建臉部，讓患者恢復原本的容貌。"], "audio": "audios/40415151.mp3", "timestamp": "2025-05-26T17:24:47.097953"}
{"query": "cancer treatment", "id": "40415180", "url": "https://pubmed.ncbi.nlm.nih.gov/40415180/", "title": "Gankyrin Inhibition Can Control Helicobacter pylori Generated Gastric Cancer Using In Vivo Xenograft Models.", "summary": "BACKGROUND: Gastric cancer (GC) is a leading cause of cancer-related mortality worldwide, with Helicobacter pylori (H. pylori) infection recognized as a significant risk factor. H. pylori infects approximately 50% of the global population, contributing to chronic gastritis, peptic ulcers, and the development of GC. The oncoprotein Gankyrin (PSMD10) has been implicated in various human cancers, including hepatocellular carcinoma, gastric cancer, and lung cancer, by modulating autophagy and inflammatory pathways.\nMETHODS: In this study, we explored the role of Gankyrin in H. pylori-induced gastric tumorigenesis via a Swiss albino mouse xenograft model. Mice were subcutaneously injected with H. pylori-infected AGS cells with or without Gankyrin knockdown.\nRESULTS: We assessed tumor growth and inflammatory markers (TNF-α and IL-6) levels and Gankyrin's downstream signaling molecules (p53, pRb, and NF-κB). Our results demonstrated that Gankyrin knockdown significantly decreased tumor formation in Swiss albino mice engrafted with H. Pylori-infected AGS cells. Notably, treatment with cyclosporine A significantly decreased the expression of TNF-α in all the AGS-engrafted mice except the PBS group. Moreover, our results show that the downregulation of Gankyrin significantly elevated the expression of NF-κB, pRb, and p53.\nCONCLUSION: These findings suggest that Gankyrin plays a crucial role in H. pylori-mediated GC progression by modulating inflammatory and tumor suppressor pathways. Targeting Gankyrin could provide a therapeutic strategy to mitigate the development of GC associated with H. pylori infection.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "Gankyrin抑制作用可利用體內異種移植模型控制幽門螺旋桿菌引起的胃癌", "summary_zh": "胃癌是全球癌症死亡的主要原因之一，幽門螺旋桿菌感染是重要的危險因子。本研究探討了Gankyrin蛋白在幽門螺旋桿菌引起的胃癌發生中的作用。研究人員利用小鼠異種移植模型，發現抑制Gankyrin可以顯著減少幽門螺旋桿菌感染細胞引起的腫瘤形成。Gankyrin的抑制還能影響腫瘤微環境中的發炎反應，並調節重要的腫瘤抑制蛋白。這些結果表明，Gankyrin在幽門螺旋桿菌引起的胃癌發展中起著關鍵作用。因此，靶向Gankyrin可能成為預防和治療幽門螺旋桿菌相關胃癌的新策略。", "applications": ["場景一：胃癌高風險族群篩檢。如果開發出檢測Gankyrin活性的方法，就能更精準地找出因幽門螺旋桿菌感染而有較高胃癌風險的人，及早進行預防或治療。", "場景二：胃癌治療新方向。針對Gankyrin開發抑制劑，可以作為胃癌治療的輔助療法，特別是針對幽門螺旋桿菌感染引起的胃癌，有機會提高治療效果。", "場景三：幽門螺旋桿菌感染預防。研究Gankyrin的作用機制，有助於開發新的預防策略，降低幽門螺旋桿菌感染後發展成胃癌的機率。"], "audio": "audios/40415180.mp3", "timestamp": "2025-05-26T17:24:56.490946"}
{"query": "diabetes management", "id": "40415118", "url": "https://pubmed.ncbi.nlm.nih.gov/40415118/", "title": "Association between insulin resistance indices and prevalence of knee osteoarthritis using the Korean National health and examination survey.", "summary": "Knee osteoarthritis (OA) is associated with high insulin resistance, particularly in individuals with metabolic syndrome and type 2 diabetes. In this cross-sectional study, we aimed to explore the relationship between insulin resistance indices and the prevalence of knee OA using data from 4,209 participants of the 2009-2010 Korea National Health and Nutrition Examination Survey. We used several insulin resistance indices in our analysis: Homeostatic Model Assessment for Insulin Resistance (HOMA-IR), triglyceride-glucose (TyG) index, TyG-body mass index (TyG_BMI), TyG-waist circumference (TyG_WC), and visceral adiposity index (VAI). Without adjusting for confounding variables, the TyG_index increased the risk of knee OA by 1.056. After adjusting for confounders, the risk increased significantly by 1.082. Similarly, the TyG_BMI, TyG_WC, and VAI showed significant associations with knee OA. However, the association between HOMA-IR and knee OA was not significant. BMI (with and without confounding variable adjustments) was significantly associated with knee OA, whereas no significant associations were found for hypertension, dyslipidemia, diabetes, or WC. These results suggest that insulin resistance indices, particularly TyG-related indices, are significantly associated with knee OA. This highlights the potential benefits of managing knee OA in the context of metabolic syndrome, which is often associated with increased insulin resistance.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "胰島素阻抗指標與膝關節骨關節炎盛行率的關聯性研究：基於韓國國民健康與營養調查", "summary_zh": "本研究旨在探討胰島素阻抗與膝關節骨關節炎的關聯。研究分析了2009-2010年韓國國民健康與營養調查中4209名參與者的數據，並使用多種胰島素阻抗指標，包括HOMA-IR、三酸甘油酯-葡萄糖 (TyG) 指數、TyG-身體質量指數 (TyG_BMI)、TyG-腰圍 (TyG_WC) 和內臟肥胖指數 (VAI)。結果顯示，TyG相關指數與膝關節骨關節炎顯著相關，特別是TyG_BMI、TyG_WC和VAI。這表明在代謝症候群的背景下，控制胰島素阻抗可能對膝關節骨關節炎的管理有所助益。BMI也與膝關節骨關節炎顯著相關，而高血壓、血脂異常或糖尿病則沒有顯著關聯。", "applications": ["預防勝於治療：透過定期健康檢查追蹤TyG指數，及早發現胰島素阻抗問題，並透過飲食和運動來改善，降低未來罹患膝關節骨關節炎的風險。就好比定期保養汽車，避免日後大修。", "個人化治療：針對已經罹患膝關節骨關節炎的患者，醫師可以評估其胰島素阻抗程度，制定更全面的治療計畫，除了傳統的止痛藥和物理治療外，也可能建議調整飲食或使用改善胰島素阻抗的藥物，以減緩關節炎的惡化。", "健康飲食與運動：研究結果提醒我們，維持健康的體重和良好的代謝功能，對於保護膝關節非常重要。鼓勵大家多運動，選擇均衡的飲食，避免過多的糖分和油脂攝取，才能擁有健康的膝蓋。"], "audio": "audios/40415118.mp3", "timestamp": "2025-05-26T17:25:10.233381"}
{"query": "artificial intelligence", "id": "40415116", "url": "https://pubmed.ncbi.nlm.nih.gov/40415116/", "title": "Combining graph neural network and Mamba to capture local and global tissue spatial relationships in whole slide images.", "summary": "In computational pathology, extracting and representing spatial features from gigapixel whole slide images (WSIs) are fundamental tasks, but due to their large size, WSIs are typically segmented into smaller tiles. A critical aspect of analyzing WSIs is how information across tiles is aggregated to predict outcomes such as patient prognosis. We introduce a model that combines a message-passing graph neural network (GNN) with a state space model (Mamba) to capture both local and global spatial relationships among the tiles in WSIs. The model's effectiveness was demonstrated in predicting progression-free survival among patients with early-stage lung adenocarcinomas (LUAD). We compared the model with other state-of-the-art methods for tile-level information aggregation in WSIs, including statistics-based, multiple instance learning (MIL)-based, GNN-based, and GNN-transformer-based aggregation. Our model achieved the highest c-index (0.70) and has the largest number of parameters among comparison models yet maintained a short inference time. Additional experiments showed the impact of different types of node features and different tile sampling strategies on model performance. Code: https://github.com/rina-ding/gat-mamba .", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "結合圖神經網路與Mamba模型以捕捉全玻片影像中的局部與全局組織空間關係", "summary_zh": "這項研究提出一個新的模型，結合圖神經網路（GNN）和狀態空間模型（Mamba），來分析病理切片影像。傳統上，由於全玻片影像檔案太大，會被分割成小圖塊來處理。這個模型能有效地整合這些小圖塊的資訊，同時考慮局部和全局的空間關係，進而預測疾病的發展，例如早期肺腺癌患者的無惡化存活期。研究結果顯示，這個模型在預測早期肺腺癌患者的預後方面表現優異，超越了其他現有方法，並在維持快速推論速度的同時，達到了最高的預測準確度(c-index=0.70)。", "applications": ["癌症預測：醫生可以利用這個模型分析病理切片，更準確地預測癌症的發展情況，例如癌症復發的風險，幫助制定更適合患者的治療方案。", "藥物開發：藥廠可以利用這個模型來分析藥物對腫瘤組織的影響，了解藥物的作用機制，加速新藥的開發過程。", "個人化醫療：透過分析每個患者的病理切片，這個模型可以幫助醫生了解患者的獨特疾病特徵，從而提供更精準的個人化治療建議。"], "audio": "audios/40415116.mp3", "timestamp": "2025-05-26T17:30:50.405166"}
{"query": "deep learning", "id": "40415110", "url": "https://pubmed.ncbi.nlm.nih.gov/40415110/", "title": "An advanced three stage lightweight model for underwater human detection.", "summary": "This study presents StarEye, a lightweight deep learning model designed for underwater human body detection (UHBD) that addresses the challenges of complex underwater environments. The proposed model incorporates several innovative components: a comprehensive underwater dataset construction methodology, a StarBlock-based backbone structure for efficient feature extraction, a Context Anchor Attention (CAA) mechanism integrated into both backbone and neck components, and a Shared Convolution Batch Normalization (SCBN) detection head. Extensive experiments demonstrate that StarEye achieves 91.1% precision, 88.6% recall, and 95.1% mAP50 while reducing the model size to 3.8MB (16.9% of the original size). The model maintains robust performance across various underwater conditions, including poor visibility, varying illumination, and biological interference. The results indicate that StarEye effectively balances model efficiency and detection accuracy, making it particularly suitable for mobile device deployment in underwater scenarios.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "用於水下人體偵測的先進三階段輕量化模型", "summary_zh": "本研究提出名為StarEye的輕量化深度學習模型，專為水下人體偵測設計，旨在解決複雜水下環境的挑戰。StarEye整合了多項創新技術，包括全面的水下數據集構建方法、基於StarBlock的高效特徵提取骨幹網路、融入骨幹和頸部組件的上下文錨點注意力（CAA）機制，以及共享卷積批次歸一化（SCBN）檢測頭。實驗結果顯示，StarEye在模型大小縮減至3.8MB（僅為原始大小的16.9%）的同時，仍能達到91.1%的精確度、88.6%的召回率和95.1%的mAP50。該模型在各種水下條件下，包括低能見度、不同照明和生物干擾下，均能保持穩健的性能。StarEye有效平衡了模型效率和偵測準確性，特別適合於水下場景中的移動設備部署。", "applications": ["水下搜救：想像一下，當有人在水下失蹤時，救援人員可以利用搭載StarEye的輕型無人機快速掃描水域，即使在能見度不佳的水域也能有效偵測到受困者，大幅提升救援效率。", "水下設施巡檢：水壩、橋墩等水下結構需要定期檢查，傳統方式耗時耗力且危險。利用搭載StarEye的水下機器人，可以自動巡檢這些設施，及早發現潛在問題，降低維護成本和風險。", "海洋生態研究：海洋生物學家可以使用搭載StarEye的設備，在不干擾海洋生物的情況下，監測特定物種的數量和行為，例如追蹤稀有海洋哺乳動物，幫助我們更好地了解和保護海洋生態。"], "audio": "audios/40415110.mp3", "timestamp": "2025-05-26T17:31:01.958125"}
{"query": "cancer treatment", "id": "40415161", "url": "https://pubmed.ncbi.nlm.nih.gov/40415161/", "title": "The association between chronic liver disease and osteoporosis in East Asian populations: a bidirectional Mendelian randomization study.", "summary": "BACKGROUND: Chronic liver disease is a widespread health problem globally, particularly common in East Asia. Osteoporosis (OP), as a common metabolic bone disease, has also gained increasing attention in aging societies. In recent years, studies have suggested a possible association between chronic liver disease and OP, but their causal relationship has not been fully or systematically studied.\nOBJECTIVE: To investigate the causal association between chronic liver disease and OP in East Asian populations using Mendelian randomization (MR) methods.\nMETHODS: The datasets for chronic hepatitis B infection (CHB), chronic hepatitis C infection (CHC), and cirrhosis were sourced from the UK Biobank, while those for hepatocellular carcinoma (HCC) and OP were from the Japan Biobank. All participants included were from East Asian populations. We first treated chronic liver disease as the exposure and OP as the outcome for MR analysis, and then performed a reverse analysis treating OP as the exposure and chronic liver disease as the outcome. The inverse variance-weighted (IVW) method was used as the primary method to calculate odds ratios (ORs) and 95% confidence intervals (95% CIs). MR-Egger and the weighted median method were used as supplementary approaches to assess the causal association between chronic liver disease and OP. Heterogeneity and pleiotropy tests were also performed to ensure the reliability of the results.\nRESULTS: The IVW method results indicated that CHB (ebi-a-GCST90018584) will increase the incidence of OP (bbj-a-137) (OR = 1.063, 95% CI: 1.015-1.112, p = 0.009), with no evidence of heterogeneity or pleiotropy. However, no causal association was found between CHC, cirrhosis, or HCC on OP. Reverse MR analyses did not reveal any significant causal effect of OP on chronic liver disease.\nCONCLUSION: In East Asian populations, CHB will increase the incidence of OP. Therefore, CHB patients not only require long-term antiviral treatment to protect the liver but should also monitor their bone health over time to reduce the risk of OP, ultimately improving quality of life.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "慢性肝病與骨質疏鬆症在東亞人群中的關聯性：一項雙向孟德爾隨機化研究", "summary_zh": "這項研究探討了慢性肝病和骨質疏鬆症在東亞人群中的關聯性。研究發現，慢性B型肝炎（CHB）會增加骨質疏鬆症（OP）的發生風險。研究人員使用孟德爾隨機化方法，分析了來自英國生物樣本庫和日本生物樣本庫的數據，結果顯示CHB與OP之間存在因果關係，但慢性C型肝炎、肝硬化或肝細胞癌與OP之間沒有顯著關聯。反向分析也未發現OP對慢性肝病有顯著影響。因此，研究建議慢性B型肝炎患者在長期抗病毒治療的同時，也應定期監測骨骼健康，以降低骨質疏鬆症的風險，從而提高生活品質。", "applications": ["【長照機構骨鬆風險評估】：長照機構可以針對有B肝病史的長者，加強骨質密度檢測，及早發現骨鬆風險，並提供飲食和運動建議，預防跌倒骨折。", "【B肝患者骨骼健康管理】：B肝患者在定期回診追蹤肝臟狀況時，可以主動詢問醫生是否需要進行骨質密度檢查，及早發現骨鬆問題，及早治療。", "【健康講座宣導】：醫療機構或社區組織可以舉辦健康講座，向民眾宣導B肝與骨鬆之間的關聯性，提醒B肝患者注意骨骼健康，並提供相關的預防和治療資訊。"], "audio": "audios/40415161.mp3", "timestamp": "2025-05-26T17:31:11.896231"}
{"query": "diabetes management", "id": "40415081", "url": "https://pubmed.ncbi.nlm.nih.gov/40415081/", "title": "The diabetic neuropathy and bone mineral density in type 2 diabetes mellitus: a cross-sectional and meta-analytic study.", "summary": "Diabetic neuropathy (DN) is a common complication of type 2 diabetes mellitus (T2DM), yet its impact on bone mineral density (BMD) remains unclear. This study combines cross-sectional and meta-analytic methods to comprehensively explore the relationship between DN and osteoporosis in T2DM patients. The cross-sectional study included 523 T2DM patients, classified into DN and non-DN groups. BMD was measured using dual-energy X-ray absorptiometry (DXA), and multivariate analysis identified osteoporosis-related factors. The meta-analysis included studies published from 1999 to 2021, comparing BMD between patients with and without DN. The results showed that while significant differences in clinical characteristics and biochemical indices (such as age, HbA1c, and 25(OH) vitamin D levels) were observed between the groups, no significant association between DN and osteoporosis was found after adjusting for covariates like body mass index and blood pressure. Additionally, the meta-analysis confirmed no significant impact of DN on BMD across skeletal sites, including the lumbar spine, hip, and femoral neck. These findings suggest that while DN may indirectly affect bone health through alterations in bone metabolism (such as bone formation markers), its direct impact on BMD is limited. The study's limitations include its cross-sectional design, which restricts causal inference, and retrospective data collection, underscoring the need for prospective studies to further elucidate the mechanisms behind DN's effects on bone health. These results highlight the complex interplay of factors influencing osteoporosis risk in T2DM and underscore the importance of a multifactorial approach to bone health management in this population.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "第二型糖尿病神經病變與骨礦物質密度：橫斷面研究與統合分析", "summary_zh": "本研究探討第二型糖尿病神經病變(DN)與骨質疏鬆症的關聯性。研究結合橫斷面研究和統合分析，橫斷面研究納入523名第二型糖尿病患者，分為DN組和非DN組，測量骨礦物質密度(BMD)。統合分析則納入1999年至2021年發表的相關研究。結果顯示，雖然兩組在年齡、糖化血色素和維生素D水平等臨床特徵和生化指標上存在顯著差異，但在調整身體質量指數和血壓等變數後，DN與骨質疏鬆症之間並無顯著關聯。統合分析也證實DN對腰椎、髖部和股骨頸等骨骼部位的BMD沒有顯著影響。研究表明，DN可能透過改變骨骼代謝間接影響骨骼健康，但其對BMD的直接影響有限。未來需要更多前瞻性研究來闡明DN對骨骼健康的影響機制。這項研究強調了影響第二型糖尿病患者骨質疏鬆症風險的多重因素，並強調了對該人群進行骨骼健康管理時，採取多因素方法的重要性。", "applications": ["1.  糖尿病患者的骨骼照護：研究發現糖尿病神經病變與骨質疏鬆症沒有直接關聯，提醒醫生在評估糖尿病患者的骨骼健康時，不能只關注神經病變，還要考慮其他風險因素，像是體重、血壓和維生素D含量，才能更全面地保護他們的骨骼。", "2.  糖尿病研究的新方向：雖然研究說神經病變和骨質疏鬆症沒有直接關係，但可能透過其他方式影響骨骼。這讓科學家們可以進一步研究神經病變如何間接影響骨骼健康，找到新的治療方法，幫助糖尿病患者維持骨骼強壯。", "3.  預防骨質疏鬆症的提醒：這項研究告訴我們，即使沒有神經病變，糖尿病患者還是要特別注意骨骼健康，因為糖尿病本身就是骨質疏鬆症的風險因素。所以，要記得均衡飲食、適度運動、補充鈣質和維生素D，才能預防骨質疏鬆症。"], "audio": "audios/40415081.mp3", "timestamp": "2025-05-26T17:31:26.603800"}
{"query": "artificial intelligence", "id": "40415107", "url": "https://pubmed.ncbi.nlm.nih.gov/40415107/", "title": "Exploring treatment effects and fluid resuscitation strategies in septic shock: a deep learning-based causal inference approach.", "summary": "Septic shock exhibits diverse etiologies and patient characteristics, necessitating tailored fluid management. We aimed to compare resuscitation strategies using normal saline, Ringer's lactate, and albumin, and to determine which patient factors are associated with improved outcomes. We analyzed septic shock patients from the MIMIC-IV database, categorizing them by the fluid administered: normal saline, Ringer's lactate, albumin, or their combinations. A deep learning-based causal inference model estimated treatment effects on in-hospital mortality and kidney outcomes (defined as a doubling of creatinine or the initiation of kidney replacement therapy). Multivariable logistic regression was then applied to the individual treatment effects to identify patient characteristics linked to better outcomes for Ringer's lactate and additional albumin infusion compared to normal saline alone. Among 13,527 patients, 17.8% experienced in-hospital mortality and 16.2% developed kidney injury. Ringer's lactate reduced mortality by 2.33% and kidney injury by 1.41% compared to normal saline. Adding albumin to normal saline further reduced mortality by 1.20% and kidney outcomes by 0.71%. The combination of Ringer's lactate and albumin provided the greatest benefit (mortality: -3.07%, kidney injury: -3.00%). Patients with high SOFA scores, low albumin, or high lactate levels benefited more from normal saline, whereas those with low eGFR or on vasopressors were less likely to benefit from albumin. Ringer's lactate, particularly when combined with albumin, is superior to normal saline in reducing mortality and kidney injury in septic shock patients, underscoring the need for personalized fluid management based on patient-specific factors.", "authors": ["Kang Yoonjin", "Ahn Shin Young", "Kang Min Woo"], "published_date": "2025-05-25", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "探討敗血性休克治療效果與輸液策略：基於深度學習的因果推斷方法", "summary_zh": "敗血性休克病因和患者特徵多樣，需要個體化的輸液管理。本研究利用深度學習因果推斷模型，分析MIMIC-IV資料庫中13527名敗血性休克患者，比較生理食鹽水、乳酸林格氏液和白蛋白等輸液策略的效果。結果顯示，與生理食鹽水相比，乳酸林格氏液能降低2.33%的死亡率和1.41%的腎損傷風險；額外添加白蛋白可進一步降低1.20%的死亡率和0.71%的腎損傷風險。乳酸林格氏液和白蛋白聯合使用效果最佳。研究還發現，SOFA評分高、白蛋白低或乳酸高的患者從生理食鹽水中獲益更多，而eGFR低或使用升壓藥的患者則不太可能從白蛋白中獲益。因此，對於敗血性休克患者，乳酸林格氏液，特別是與白蛋白聯合使用，在降低死亡率和腎損傷方面優於生理食鹽水，強調了基於患者特定因素進行個體化輸液管理的重要性。", "applications": ["1. **急診室快速決策輔助：** 想像一下，急診室醫生面對一位敗血性休克病人，時間緊迫。這個研究的成果可以開發成一個AI輔助決策工具，醫生輸入病人的基本數據（例如：SOFA評分、白蛋白值、乳酸值等），AI就能建議最適合這位病人的輸液方案，例如優先考慮乳酸林格氏液或聯合白蛋白，提高搶救成功率。", "2. **ICU精準治療方案：** 在加護病房（ICU），醫生可以更頻繁地監測病人的生理指標。利用這個研究的知識，醫生可以根據病人病情變化，動態調整輸液策略。例如，如果發現病人腎功能開始下降，醫生可以考慮調整輸液方案，避免使用可能加重腎損傷的藥物，實現更精準的治療。", "3. **藥廠新藥開發方向：** 這個研究發現不同輸液策略對不同病人的效果不同。藥廠可以根據這些發現，開發針對特定類型敗血性休克病人的新型輸液產品，例如針對低白蛋白血症的敗血性休克病人，開發含有高濃度白蛋白的特殊輸液，提高治療效果。"], "audio": "audios/40415107.mp3", "timestamp": "2025-05-26T17:50:37.305013"}
{"query": "deep learning", "id": "40415073", "url": "https://pubmed.ncbi.nlm.nih.gov/40415073/", "title": "Differentiability of voice disorders through explainable AI.", "summary": "The voice can be affected by various types of pathology. The phoniatric medical examination is the acoustic analysis, which evaluates the characteristic parameters extracted from the vocal signal. Computer-assisted decision-making systems can help specialists to detect vocal pathologies using only the patient's voice. In this study, transfer learning techniques are used to perform the acoustic analysis. Fine-tuned OpenL3 then predicts whether or not the signals contain a pathology by classifying them under 8 different pathologies. A publicly available dataset is used with the categories Hyperkinetic dysphonia, Hypokinetic dysphonia, reflux laryngitis vocal fold nodules, prolapse, glottic insufficiency and vocal fold paralysis in addition to the Healthy class. The results obtained are very convincing. The accuracy with OpenL3, using tranfer learning, was 99.44%. In addition, explainable decision support systems (XDSS) provide an in-depth understanding of the decision-making process. Obtaining an image resulting from the averaging of all the Occlusion Sensitivity maps will enable us to understand the spatio-temporal characteristics of the disordered voices used for classification. Thanks to explainability methods, a new term, the differentiability, can be discussed to explain the black-box operation of deep networks. For purposes of rapid diagnosis and prevention, this work could provide more detail on disordered voices by enabling a promising explainable diagnosis.", "authors": ["Özcan Fatma"], "published_date": "2025-05-25", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "透過可解釋性人工智慧區分聲音障礙", "summary_zh": "這項研究利用人工智慧分析聲音，以協助醫生診斷聲音障礙。研究團隊運用轉移學習技術，讓AI能夠辨識八種不同的聲音病理，準確率高達99.44%。更重要的是，研究採用了可解釋性決策支援系統(XDSS)，讓AI的判斷過程更加透明，醫生可以理解AI是如何做出診斷的。透過分析聲音特徵，研究人員希望找到區分不同聲音障礙的關鍵要素，這有助於未來開發更快速、更精準的聲音診斷工具，實現早期預防和治療。", "applications": ["想像一下，以後只要對著手機App講幾句話，AI就能初步判斷你的聲音有沒有問題，例如聲帶長繭或發炎，提醒你及早就醫檢查。", "如果老師或客服人員長時間使用聲音，可以利用這個技術定期監測聲帶健康狀況，預防職業性的聲音損傷。", "對於中風或神經退化性疾病的患者，聲音分析可以幫助評估語言功能的恢復情況，並提供更精準的復健計畫。"], "audio": "audios/40415073.mp3", "timestamp": "2025-05-26T17:50:46.133132"}
{"query": "diabetes management", "id": "40415035", "url": "https://pubmed.ncbi.nlm.nih.gov/40415035/", "title": "Artificial pancreas: the past and the future.", "summary": "In glucose management using continuous insulin infusion, artificial pancreas systems prevent blood glucose fluctuations and severe hypoglycemia using insulin pumps and continuous glucose monitoring. Advances in both insulin pumps and continuous glucose monitoring have enabled the transition from sensor augmented pump therapy, where insulin delivery is manually adjusted, to hybrid closed-loop insulin pump therapy, which automatically adjusts basal insulin infusion. Furthermore, fully automated insulin delivery systems that adjust insulin based on variations due to meals and exercise are now possible. These systems have been primarily applied to patients with type 1 diabetes but are now expanding to all insulin-dependent patients. Wearable artificial pancreas systems measure glucose levels in subcutaneous tissue fluid, while bedside artificial pancreas systems measure glucose levels in venous blood, making them suitable for managing the highly variable blood glucose levels of perioperative and critically ill patients. Future developments are anticipated to integrate the benefits of both wearable and bedside systems.", "authors": ["Kitagawa Hiroyuki", "Munekage Masaya", "Seo Satoru", "Hanazaki Kazuhiro"], "published_date": "2025-05-25", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "人工胰臟：過去與未來", "summary_zh": "人工胰臟系統利用胰島素幫浦和連續血糖監測，有效控制血糖波動，預防嚴重低血糖。從過去需手動調整胰島素的療法，進展到現在的混合式閉環系統，能自動調整基礎胰島素劑量。更先進的全自動系統，甚至能根據飲食和運動調整胰島素。這項技術最初應用於第一型糖尿病患者，現在也擴展到所有胰島素依賴型患者。穿戴式人工胰臟監測皮下組織液的血糖，而床邊型則監測靜脈血的血糖，適用於手術前後和重症患者，能有效管理他們不穩定的血糖。未來，這兩種系統的優點有望整合。", "applications": ["想像一下，對於需要頻繁注射胰島素的糖尿病患者，這個人工胰臟就像一個貼身管家，自動監測血糖並調整胰島素劑量，讓他們不再需要 постоянно擔心血糖忽高忽低，可以更自由地享受生活。", "對於剛做完手術或正在加護病房的病人，血糖控制非常重要。床邊型人工胰臟就像一個精準的血糖控制儀器，幫助醫生穩定病人的血糖，降低感染風險，提高康復機會。", "運動愛好者有福了！有了全自動人工胰臟，它可以根據你的運動量自動調整胰島素，讓你運動時不用擔心低血糖，可以更盡情地揮灑汗水，享受運動的樂趣。"], "audio": "audios/40415035.mp3", "timestamp": "2025-05-26T17:50:55.787810"}
