{"query": "artificial intelligence", "id": "40415121", "url": "https://pubmed.ncbi.nlm.nih.gov/40415121/", "title": "Advancing e-waste classification with customizable YOLO based deep learning models.", "summary": "The burgeoning problem of electronic waste (e-waste) management necessitates sophisticated, efficient, and precise classification techniques for recycling and repurposing. To address these critical environmental and health implications, this research delves into a comprehensive analysis of three cutting-edge object detection models: YOLOv5, YOLOv7, and YOLOv8. These models are examined through the lens of efficient e-waste classification, a pivotal step in recycling and repurposing efforts. The 'You Only Look Once' (YOLO) methodology underpins our research, highlighting the distinctive architectural features of each model, including the CSPDarknet53 backbone, PANet, and advanced anchor-free detection. This research approach involved the creation of a specialized image dataset encompassing seven distinct e-waste categories to facilitate the training and validation of these models. The performance of improved and customizable YOLOv5, YOLOv7, and YOLOv8 was meticulously evaluated across various parameters such as precision, recall, speed, and training efficiency. This evaluation explores the architectural nuances of each model and its efficacy in accurately detecting diverse e-waste components. The standout performer, YOLOv8, demonstrated exceptional capabilities with its enhanced feature pyramid networks and improved CSPDarknet53 backbone with 53 convolutional layers, achieving superior precision and accuracy. Notably, this model showcased a significant reduction in training time while leveraging the computational power of the Tesla T4 GPU on Google Colab. However, the research also identified challenges, particularly in object orientation detection, suggesting avenues for future refinement. This study underscores the vital role of advanced YOLO architectures in e-waste management, providing critical insights into their practical viability, applicability in real-world scenarios, and potential limitations. By setting a benchmark in real-time object detection, our work paves the way for future innovations and improvements in environmental management technologies, specifically tailored to meet the escalating challenge of e-waste management.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "利用可客製化YOLO深度學習模型提升電子廢棄物分類", "summary_zh": "電子廢棄物日益嚴重的問題，需要更精密、高效和準確的分類技術來進行回收和再利用。本研究深入分析了YOLOv5、YOLOv7和YOLOv8三種先進的物件偵測模型，用於高效的電子廢棄物分類。研究創建了一個包含七種不同電子廢棄物類別的專用圖像數據集，用於訓練和驗證這些模型。評估了各模型的精確度、召回率、速度和訓練效率等參數。YOLOv8表現最為出色，具有增強的特徵金字塔網絡和改良的CSPDarknet53主幹，展現了卓越的精確度和準確性，並顯著縮短了訓練時間。本研究強調了先進YOLO架構在電子廢棄物管理中的重要作用，並為未來的環境管理技術創新奠定了基礎。", "applications": ["想像一下，以後回收場可以利用AI快速分辨不同種類的電子垃圾，像是手機、電腦、還是電線，這樣就能更有效率地拆解和回收有用的材料，減少環境污染。", "如果我們在工廠裡導入這項技術，就能自動檢測生產線上是否有瑕疵的電子零件，及早發現問題，避免浪費資源，提升產品品質。", "未來海關可以使用這個AI系統來檢查進口的貨物，快速辨識裡面是否夾帶了違禁的電子廢棄物，防止非法傾倒，保護我們的環境。"], "audio": "audios/40415121.mp3", "timestamp": "2025-05-26T17:24:25.138345"}
{"query": "machine learning", "id": "40415143", "url": "https://pubmed.ncbi.nlm.nih.gov/40415143/", "title": "Development and validation of a predictive model for refracture risk in elderly individuals with osteoporotic vertebral compression fracture: a retrospective study in China.", "summary": "BACKGROUND: The rising incidence of refractures and associated adverse outcomes among individuals with osteoporotic vertebral compression fractures has gained significant attention. Identifying refracture risk is crucial for implementing effective preventive strategies. This study aimed to develop a predictive model for assessing the risk of refracture following an initial vertebral fragility fracture.\nMETHODS: The study included both men and women, focusing on individuals aged 60 and above. The fractures were diagnosed using X-rays. Participants from three centers were used for model development, while the fourth center was used for validation. The discrimination and calibration of each model was assessed using the validation set. A predictive model for preoperative refracture risk was developed using logistic regression analysis and visualized via a nomogram.\nRESULTS: A total of 1,632 participants with a median age of 72 years were enrolled, of whom 428 had experienced a refracture. Eleven factors were identified as significant predictors of refracture: age, rehabilitation status, treatment regimen, alcohol consumption, body mass index (BMI), duration of medication use, history of comorbidities, fall risk, and levels of bone gla protein (BGP), total alkaline phosphatase (TALP), and homocysteine (Hcy). The average AUC of the nomogram was 0.936 (0.92-0.952) in the training set and 0.922 (0.894-0.949) in the validation set. The values for sensitivity, specificity, and accuracy were 0.825, 0.908, and 0.885, respectively.\nCONCLUSION: Eleven independent risk factors for refracture were identified and incorporated into a nomogram, which was subsequently converted into an online calculator. This tool can be used to evaluate the risk of refracture in individuals with initial fragility fractures, showing the potential to inform clinical decision-making and optimize patient management. The global applicability of the developed tool still needs to be tested and calibrated by including diverse populations, as this study only included Chinese participants during the tool development phase.\nCLINICAL REGISTRATION NUMBER: Not applicable.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "骨質疏鬆性椎體壓縮性骨折老年患者再骨折風險預測模型的開發與驗證：一項中國回顧性研究", "summary_zh": "這項研究旨在開發一個預測模型，評估老年人在首次發生骨質疏鬆性椎體壓縮性骨折後再次骨折的風險。研究納入了1632名60歲以上的參與者，並分析了11個顯著的再骨折預測因子，包括年齡、復健狀況、治療方案、飲酒、身體質量指數、用藥時間、合併症病史、跌倒風險以及骨鈣素、總鹼性磷酸酶和同型半胱氨酸的水平。研究人員利用這些因子建立了一個列線圖，並將其轉換為線上計算器。該模型在驗證集中表現出良好的區分度和校準度，可用於評估患者的再骨折風險，從而協助臨床決策並優化患者管理。但由於該工具的開發階段僅納入中國參與者，其全球適用性仍需通過納入不同人群進行測試和校準。", "applications": ["【長輩跌倒風險評估】家裡長輩之前不小心骨折過，現在可以透過這個線上計算機，輸入一些基本資料，就能快速評估他們再次骨折的風險，讓我們能更注意他們的居家安全，像是加裝扶手、改善照明等等。", "【骨質疏鬆治療效果追蹤】如果長輩正在接受骨質疏鬆的治療，我們可以定期用這個工具評估他們的再骨折風險變化。如果風險沒有明顯下降，就表示可能需要調整治療方案，才能更有效地預防骨折。", "【社區關懷據點健康講座】在社區活動中，我們可以利用這個研究結果，向長者宣導骨質疏鬆和預防骨折的重要性。透過簡單易懂的說明，讓他們了解哪些因素會增加骨折風險，並鼓勵他們主動尋求醫療協助。"], "audio": "audios/40415143.mp3", "timestamp": "2025-05-26T17:24:37.274748"}
{"query": "deep learning", "id": "40415151", "url": "https://pubmed.ncbi.nlm.nih.gov/40415151/", "title": "Automated landmark-based mid-sagittal plane: reliability for 3-dimensional mandibular asymmetry assessment on head CT scans.", "summary": "OBJECTIVE: The determination of the mid-sagittal plane (MSP) on three-dimensional (3D) head imaging is key to the assessment of facial asymmetry. The aim of this study was to evaluate the reliability of an automated landmark-based MSP to quantify mandibular asymmetry on head computed tomography (CT) scans.\nMATERIALS AND METHODS: A dataset of 368 CT scans, including orthognathic surgery patients, was automatically annotated with 3D cephalometric landmarks via a previously published deep learning-based method. Five of these landmarks were used to automatically construct an MSP orthogonal to the Frankfurt horizontal plane. The reliability of automatic MSP construction was compared with the reliability of manual MSP construction based on 6 manual localizations by 3 experienced operators on 19 randomly selected CT scans. The mandibular asymmetry of the 368 CT scans with respect to the MSP was calculated and compared with clinical expert judgment.\nRESULTS: The construction of the MSP was found to be highly reliable, both manually and automatically. The manual reproducibility 95% limit of agreement was less than 1 mm for -y translation and less than 1.1° for -x and -z rotation, and the automatic measurement lied within the confidence interval of the manual method. The automatic MSP construction was shown to be clinically relevant, with the mandibular asymmetry measures being consistent with the expertly assessed levels of asymmetry.\nCONCLUSION: The proposed automatic landmark-based MSP construction was found to be as reliable as manual construction and clinically relevant in assessing the mandibular asymmetry of 368 head CT scans.\nCLINICAL RELEVANCE: Once implemented in a clinical software, fully automated landmark-based MSP construction could be clinically used to assess mandibular asymmetry on head CT scans.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "基於自動化地標的中矢狀面：用於頭部CT掃描中三維下頜不對稱評估的可靠性", "summary_zh": "本研究旨在評估一種基於自動化地標的中矢狀面(MSP)在量化頭部電腦斷層掃描(CT)下頜不對稱方面的可靠性。研究使用包含正頜手術患者的368個CT掃描數據集，通過深度學習方法自動標註3D頭影測量地標。其中五個地標用於自動構建垂直於法蘭克福水平面的MSP。結果表明，自動和手動MSP構建均具有高度可靠性，且自動MSP構建在臨床上具有相關性，下頜不對稱測量結果與專家評估的不對稱程度一致。結論是，所提出的基於自動化地標的MSP構建與手動構建一樣可靠，並且在評估368個頭部CT掃描的下頜不對稱方面具有臨床意義。此技術未來可應用於臨床軟體，以評估下頜不對稱。", "applications": ["想像一下，未來牙醫或整形外科醫生在評估臉部歪斜程度時，不再需要手動測量，電腦可以自動判斷，大幅縮短評估時間，讓醫生可以更專注於治療計畫。", "如果小朋友的臉部發育不對稱，透過這個技術可以及早發現問題，及早介入矯正，避免影響未來的臉部外觀和功能。", "車禍或意外事故造成臉部骨骼受傷，這個技術可以幫助醫生更精準地重建臉部，讓患者恢復原本的容貌。"], "audio": "audios/40415151.mp3", "timestamp": "2025-05-26T17:24:47.097953"}
{"query": "cancer treatment", "id": "40415180", "url": "https://pubmed.ncbi.nlm.nih.gov/40415180/", "title": "Gankyrin Inhibition Can Control Helicobacter pylori Generated Gastric Cancer Using In Vivo Xenograft Models.", "summary": "BACKGROUND: Gastric cancer (GC) is a leading cause of cancer-related mortality worldwide, with Helicobacter pylori (H. pylori) infection recognized as a significant risk factor. H. pylori infects approximately 50% of the global population, contributing to chronic gastritis, peptic ulcers, and the development of GC. The oncoprotein Gankyrin (PSMD10) has been implicated in various human cancers, including hepatocellular carcinoma, gastric cancer, and lung cancer, by modulating autophagy and inflammatory pathways.\nMETHODS: In this study, we explored the role of Gankyrin in H. pylori-induced gastric tumorigenesis via a Swiss albino mouse xenograft model. Mice were subcutaneously injected with H. pylori-infected AGS cells with or without Gankyrin knockdown.\nRESULTS: We assessed tumor growth and inflammatory markers (TNF-α and IL-6) levels and Gankyrin's downstream signaling molecules (p53, pRb, and NF-κB). Our results demonstrated that Gankyrin knockdown significantly decreased tumor formation in Swiss albino mice engrafted with H. Pylori-infected AGS cells. Notably, treatment with cyclosporine A significantly decreased the expression of TNF-α in all the AGS-engrafted mice except the PBS group. Moreover, our results show that the downregulation of Gankyrin significantly elevated the expression of NF-κB, pRb, and p53.\nCONCLUSION: These findings suggest that Gankyrin plays a crucial role in H. pylori-mediated GC progression by modulating inflammatory and tumor suppressor pathways. Targeting Gankyrin could provide a therapeutic strategy to mitigate the development of GC associated with H. pylori infection.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "Gankyrin抑制作用可利用體內異種移植模型控制幽門螺旋桿菌引起的胃癌", "summary_zh": "胃癌是全球癌症死亡的主要原因之一，幽門螺旋桿菌感染是重要的危險因子。本研究探討了Gankyrin蛋白在幽門螺旋桿菌引起的胃癌發生中的作用。研究人員利用小鼠異種移植模型，發現抑制Gankyrin可以顯著減少幽門螺旋桿菌感染細胞引起的腫瘤形成。Gankyrin的抑制還能影響腫瘤微環境中的發炎反應，並調節重要的腫瘤抑制蛋白。這些結果表明，Gankyrin在幽門螺旋桿菌引起的胃癌發展中起著關鍵作用。因此，靶向Gankyrin可能成為預防和治療幽門螺旋桿菌相關胃癌的新策略。", "applications": ["場景一：胃癌高風險族群篩檢。如果開發出檢測Gankyrin活性的方法，就能更精準地找出因幽門螺旋桿菌感染而有較高胃癌風險的人，及早進行預防或治療。", "場景二：胃癌治療新方向。針對Gankyrin開發抑制劑，可以作為胃癌治療的輔助療法，特別是針對幽門螺旋桿菌感染引起的胃癌，有機會提高治療效果。", "場景三：幽門螺旋桿菌感染預防。研究Gankyrin的作用機制，有助於開發新的預防策略，降低幽門螺旋桿菌感染後發展成胃癌的機率。"], "audio": "audios/40415180.mp3", "timestamp": "2025-05-26T17:24:56.490946"}
{"query": "diabetes management", "id": "40415118", "url": "https://pubmed.ncbi.nlm.nih.gov/40415118/", "title": "Association between insulin resistance indices and prevalence of knee osteoarthritis using the Korean National health and examination survey.", "summary": "Knee osteoarthritis (OA) is associated with high insulin resistance, particularly in individuals with metabolic syndrome and type 2 diabetes. In this cross-sectional study, we aimed to explore the relationship between insulin resistance indices and the prevalence of knee OA using data from 4,209 participants of the 2009-2010 Korea National Health and Nutrition Examination Survey. We used several insulin resistance indices in our analysis: Homeostatic Model Assessment for Insulin Resistance (HOMA-IR), triglyceride-glucose (TyG) index, TyG-body mass index (TyG_BMI), TyG-waist circumference (TyG_WC), and visceral adiposity index (VAI). Without adjusting for confounding variables, the TyG_index increased the risk of knee OA by 1.056. After adjusting for confounders, the risk increased significantly by 1.082. Similarly, the TyG_BMI, TyG_WC, and VAI showed significant associations with knee OA. However, the association between HOMA-IR and knee OA was not significant. BMI (with and without confounding variable adjustments) was significantly associated with knee OA, whereas no significant associations were found for hypertension, dyslipidemia, diabetes, or WC. These results suggest that insulin resistance indices, particularly TyG-related indices, are significantly associated with knee OA. This highlights the potential benefits of managing knee OA in the context of metabolic syndrome, which is often associated with increased insulin resistance.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "胰島素阻抗指標與膝關節骨關節炎盛行率的關聯性研究：基於韓國國民健康與營養調查", "summary_zh": "本研究旨在探討胰島素阻抗與膝關節骨關節炎的關聯。研究分析了2009-2010年韓國國民健康與營養調查中4209名參與者的數據，並使用多種胰島素阻抗指標，包括HOMA-IR、三酸甘油酯-葡萄糖 (TyG) 指數、TyG-身體質量指數 (TyG_BMI)、TyG-腰圍 (TyG_WC) 和內臟肥胖指數 (VAI)。結果顯示，TyG相關指數與膝關節骨關節炎顯著相關，特別是TyG_BMI、TyG_WC和VAI。這表明在代謝症候群的背景下，控制胰島素阻抗可能對膝關節骨關節炎的管理有所助益。BMI也與膝關節骨關節炎顯著相關，而高血壓、血脂異常或糖尿病則沒有顯著關聯。", "applications": ["預防勝於治療：透過定期健康檢查追蹤TyG指數，及早發現胰島素阻抗問題，並透過飲食和運動來改善，降低未來罹患膝關節骨關節炎的風險。就好比定期保養汽車，避免日後大修。", "個人化治療：針對已經罹患膝關節骨關節炎的患者，醫師可以評估其胰島素阻抗程度，制定更全面的治療計畫，除了傳統的止痛藥和物理治療外，也可能建議調整飲食或使用改善胰島素阻抗的藥物，以減緩關節炎的惡化。", "健康飲食與運動：研究結果提醒我們，維持健康的體重和良好的代謝功能，對於保護膝關節非常重要。鼓勵大家多運動，選擇均衡的飲食，避免過多的糖分和油脂攝取，才能擁有健康的膝蓋。"], "audio": "audios/40415118.mp3", "timestamp": "2025-05-26T17:25:10.233381"}
{"query": "artificial intelligence", "id": "40415116", "url": "https://pubmed.ncbi.nlm.nih.gov/40415116/", "title": "Combining graph neural network and Mamba to capture local and global tissue spatial relationships in whole slide images.", "summary": "In computational pathology, extracting and representing spatial features from gigapixel whole slide images (WSIs) are fundamental tasks, but due to their large size, WSIs are typically segmented into smaller tiles. A critical aspect of analyzing WSIs is how information across tiles is aggregated to predict outcomes such as patient prognosis. We introduce a model that combines a message-passing graph neural network (GNN) with a state space model (Mamba) to capture both local and global spatial relationships among the tiles in WSIs. The model's effectiveness was demonstrated in predicting progression-free survival among patients with early-stage lung adenocarcinomas (LUAD). We compared the model with other state-of-the-art methods for tile-level information aggregation in WSIs, including statistics-based, multiple instance learning (MIL)-based, GNN-based, and GNN-transformer-based aggregation. Our model achieved the highest c-index (0.70) and has the largest number of parameters among comparison models yet maintained a short inference time. Additional experiments showed the impact of different types of node features and different tile sampling strategies on model performance. Code: https://github.com/rina-ding/gat-mamba .", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "結合圖神經網路與Mamba模型以捕捉全玻片影像中的局部與全局組織空間關係", "summary_zh": "這項研究提出一個新的模型，結合圖神經網路（GNN）和狀態空間模型（Mamba），來分析病理切片影像。傳統上，由於全玻片影像檔案太大，會被分割成小圖塊來處理。這個模型能有效地整合這些小圖塊的資訊，同時考慮局部和全局的空間關係，進而預測疾病的發展，例如早期肺腺癌患者的無惡化存活期。研究結果顯示，這個模型在預測早期肺腺癌患者的預後方面表現優異，超越了其他現有方法，並在維持快速推論速度的同時，達到了最高的預測準確度(c-index=0.70)。", "applications": ["癌症預測：醫生可以利用這個模型分析病理切片，更準確地預測癌症的發展情況，例如癌症復發的風險，幫助制定更適合患者的治療方案。", "藥物開發：藥廠可以利用這個模型來分析藥物對腫瘤組織的影響，了解藥物的作用機制，加速新藥的開發過程。", "個人化醫療：透過分析每個患者的病理切片，這個模型可以幫助醫生了解患者的獨特疾病特徵，從而提供更精準的個人化治療建議。"], "audio": "audios/40415116.mp3", "timestamp": "2025-05-26T17:30:50.405166"}
{"query": "deep learning", "id": "40415110", "url": "https://pubmed.ncbi.nlm.nih.gov/40415110/", "title": "An advanced three stage lightweight model for underwater human detection.", "summary": "This study presents StarEye, a lightweight deep learning model designed for underwater human body detection (UHBD) that addresses the challenges of complex underwater environments. The proposed model incorporates several innovative components: a comprehensive underwater dataset construction methodology, a StarBlock-based backbone structure for efficient feature extraction, a Context Anchor Attention (CAA) mechanism integrated into both backbone and neck components, and a Shared Convolution Batch Normalization (SCBN) detection head. Extensive experiments demonstrate that StarEye achieves 91.1% precision, 88.6% recall, and 95.1% mAP50 while reducing the model size to 3.8MB (16.9% of the original size). The model maintains robust performance across various underwater conditions, including poor visibility, varying illumination, and biological interference. The results indicate that StarEye effectively balances model efficiency and detection accuracy, making it particularly suitable for mobile device deployment in underwater scenarios.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "用於水下人體偵測的先進三階段輕量化模型", "summary_zh": "本研究提出名為StarEye的輕量化深度學習模型，專為水下人體偵測設計，旨在解決複雜水下環境的挑戰。StarEye整合了多項創新技術，包括全面的水下數據集構建方法、基於StarBlock的高效特徵提取骨幹網路、融入骨幹和頸部組件的上下文錨點注意力（CAA）機制，以及共享卷積批次歸一化（SCBN）檢測頭。實驗結果顯示，StarEye在模型大小縮減至3.8MB（僅為原始大小的16.9%）的同時，仍能達到91.1%的精確度、88.6%的召回率和95.1%的mAP50。該模型在各種水下條件下，包括低能見度、不同照明和生物干擾下，均能保持穩健的性能。StarEye有效平衡了模型效率和偵測準確性，特別適合於水下場景中的移動設備部署。", "applications": ["水下搜救：想像一下，當有人在水下失蹤時，救援人員可以利用搭載StarEye的輕型無人機快速掃描水域，即使在能見度不佳的水域也能有效偵測到受困者，大幅提升救援效率。", "水下設施巡檢：水壩、橋墩等水下結構需要定期檢查，傳統方式耗時耗力且危險。利用搭載StarEye的水下機器人，可以自動巡檢這些設施，及早發現潛在問題，降低維護成本和風險。", "海洋生態研究：海洋生物學家可以使用搭載StarEye的設備，在不干擾海洋生物的情況下，監測特定物種的數量和行為，例如追蹤稀有海洋哺乳動物，幫助我們更好地了解和保護海洋生態。"], "audio": "audios/40415110.mp3", "timestamp": "2025-05-26T17:31:01.958125"}
{"query": "cancer treatment", "id": "40415161", "url": "https://pubmed.ncbi.nlm.nih.gov/40415161/", "title": "The association between chronic liver disease and osteoporosis in East Asian populations: a bidirectional Mendelian randomization study.", "summary": "BACKGROUND: Chronic liver disease is a widespread health problem globally, particularly common in East Asia. Osteoporosis (OP), as a common metabolic bone disease, has also gained increasing attention in aging societies. In recent years, studies have suggested a possible association between chronic liver disease and OP, but their causal relationship has not been fully or systematically studied.\nOBJECTIVE: To investigate the causal association between chronic liver disease and OP in East Asian populations using Mendelian randomization (MR) methods.\nMETHODS: The datasets for chronic hepatitis B infection (CHB), chronic hepatitis C infection (CHC), and cirrhosis were sourced from the UK Biobank, while those for hepatocellular carcinoma (HCC) and OP were from the Japan Biobank. All participants included were from East Asian populations. We first treated chronic liver disease as the exposure and OP as the outcome for MR analysis, and then performed a reverse analysis treating OP as the exposure and chronic liver disease as the outcome. The inverse variance-weighted (IVW) method was used as the primary method to calculate odds ratios (ORs) and 95% confidence intervals (95% CIs). MR-Egger and the weighted median method were used as supplementary approaches to assess the causal association between chronic liver disease and OP. Heterogeneity and pleiotropy tests were also performed to ensure the reliability of the results.\nRESULTS: The IVW method results indicated that CHB (ebi-a-GCST90018584) will increase the incidence of OP (bbj-a-137) (OR = 1.063, 95% CI: 1.015-1.112, p = 0.009), with no evidence of heterogeneity or pleiotropy. However, no causal association was found between CHC, cirrhosis, or HCC on OP. Reverse MR analyses did not reveal any significant causal effect of OP on chronic liver disease.\nCONCLUSION: In East Asian populations, CHB will increase the incidence of OP. Therefore, CHB patients not only require long-term antiviral treatment to protect the liver but should also monitor their bone health over time to reduce the risk of OP, ultimately improving quality of life.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "慢性肝病與骨質疏鬆症在東亞人群中的關聯性：一項雙向孟德爾隨機化研究", "summary_zh": "這項研究探討了慢性肝病和骨質疏鬆症在東亞人群中的關聯性。研究發現，慢性B型肝炎（CHB）會增加骨質疏鬆症（OP）的發生風險。研究人員使用孟德爾隨機化方法，分析了來自英國生物樣本庫和日本生物樣本庫的數據，結果顯示CHB與OP之間存在因果關係，但慢性C型肝炎、肝硬化或肝細胞癌與OP之間沒有顯著關聯。反向分析也未發現OP對慢性肝病有顯著影響。因此，研究建議慢性B型肝炎患者在長期抗病毒治療的同時，也應定期監測骨骼健康，以降低骨質疏鬆症的風險，從而提高生活品質。", "applications": ["【長照機構骨鬆風險評估】：長照機構可以針對有B肝病史的長者，加強骨質密度檢測，及早發現骨鬆風險，並提供飲食和運動建議，預防跌倒骨折。", "【B肝患者骨骼健康管理】：B肝患者在定期回診追蹤肝臟狀況時，可以主動詢問醫生是否需要進行骨質密度檢查，及早發現骨鬆問題，及早治療。", "【健康講座宣導】：醫療機構或社區組織可以舉辦健康講座，向民眾宣導B肝與骨鬆之間的關聯性，提醒B肝患者注意骨骼健康，並提供相關的預防和治療資訊。"], "audio": "audios/40415161.mp3", "timestamp": "2025-05-26T17:31:11.896231"}
{"query": "diabetes management", "id": "40415081", "url": "https://pubmed.ncbi.nlm.nih.gov/40415081/", "title": "The diabetic neuropathy and bone mineral density in type 2 diabetes mellitus: a cross-sectional and meta-analytic study.", "summary": "Diabetic neuropathy (DN) is a common complication of type 2 diabetes mellitus (T2DM), yet its impact on bone mineral density (BMD) remains unclear. This study combines cross-sectional and meta-analytic methods to comprehensively explore the relationship between DN and osteoporosis in T2DM patients. The cross-sectional study included 523 T2DM patients, classified into DN and non-DN groups. BMD was measured using dual-energy X-ray absorptiometry (DXA), and multivariate analysis identified osteoporosis-related factors. The meta-analysis included studies published from 1999 to 2021, comparing BMD between patients with and without DN. The results showed that while significant differences in clinical characteristics and biochemical indices (such as age, HbA1c, and 25(OH) vitamin D levels) were observed between the groups, no significant association between DN and osteoporosis was found after adjusting for covariates like body mass index and blood pressure. Additionally, the meta-analysis confirmed no significant impact of DN on BMD across skeletal sites, including the lumbar spine, hip, and femoral neck. These findings suggest that while DN may indirectly affect bone health through alterations in bone metabolism (such as bone formation markers), its direct impact on BMD is limited. The study's limitations include its cross-sectional design, which restricts causal inference, and retrospective data collection, underscoring the need for prospective studies to further elucidate the mechanisms behind DN's effects on bone health. These results highlight the complex interplay of factors influencing osteoporosis risk in T2DM and underscore the importance of a multifactorial approach to bone health management in this population.", "authors": ["作者資訊需擴展 EFetch 解析"], "published_date": "日期需擴展 EFetch 解析", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "第二型糖尿病神經病變與骨礦物質密度：橫斷面研究與統合分析", "summary_zh": "本研究探討第二型糖尿病神經病變(DN)與骨質疏鬆症的關聯性。研究結合橫斷面研究和統合分析，橫斷面研究納入523名第二型糖尿病患者，分為DN組和非DN組，測量骨礦物質密度(BMD)。統合分析則納入1999年至2021年發表的相關研究。結果顯示，雖然兩組在年齡、糖化血色素和維生素D水平等臨床特徵和生化指標上存在顯著差異，但在調整身體質量指數和血壓等變數後，DN與骨質疏鬆症之間並無顯著關聯。統合分析也證實DN對腰椎、髖部和股骨頸等骨骼部位的BMD沒有顯著影響。研究表明，DN可能透過改變骨骼代謝間接影響骨骼健康，但其對BMD的直接影響有限。未來需要更多前瞻性研究來闡明DN對骨骼健康的影響機制。這項研究強調了影響第二型糖尿病患者骨質疏鬆症風險的多重因素，並強調了對該人群進行骨骼健康管理時，採取多因素方法的重要性。", "applications": ["1.  糖尿病患者的骨骼照護：研究發現糖尿病神經病變與骨質疏鬆症沒有直接關聯，提醒醫生在評估糖尿病患者的骨骼健康時，不能只關注神經病變，還要考慮其他風險因素，像是體重、血壓和維生素D含量，才能更全面地保護他們的骨骼。", "2.  糖尿病研究的新方向：雖然研究說神經病變和骨質疏鬆症沒有直接關係，但可能透過其他方式影響骨骼。這讓科學家們可以進一步研究神經病變如何間接影響骨骼健康，找到新的治療方法，幫助糖尿病患者維持骨骼強壯。", "3.  預防骨質疏鬆症的提醒：這項研究告訴我們，即使沒有神經病變，糖尿病患者還是要特別注意骨骼健康，因為糖尿病本身就是骨質疏鬆症的風險因素。所以，要記得均衡飲食、適度運動、補充鈣質和維生素D，才能預防骨質疏鬆症。"], "audio": "audios/40415081.mp3", "timestamp": "2025-05-26T17:31:26.603800"}
{"query": "artificial intelligence", "id": "40415107", "url": "https://pubmed.ncbi.nlm.nih.gov/40415107/", "title": "Exploring treatment effects and fluid resuscitation strategies in septic shock: a deep learning-based causal inference approach.", "summary": "Septic shock exhibits diverse etiologies and patient characteristics, necessitating tailored fluid management. We aimed to compare resuscitation strategies using normal saline, Ringer's lactate, and albumin, and to determine which patient factors are associated with improved outcomes. We analyzed septic shock patients from the MIMIC-IV database, categorizing them by the fluid administered: normal saline, Ringer's lactate, albumin, or their combinations. A deep learning-based causal inference model estimated treatment effects on in-hospital mortality and kidney outcomes (defined as a doubling of creatinine or the initiation of kidney replacement therapy). Multivariable logistic regression was then applied to the individual treatment effects to identify patient characteristics linked to better outcomes for Ringer's lactate and additional albumin infusion compared to normal saline alone. Among 13,527 patients, 17.8% experienced in-hospital mortality and 16.2% developed kidney injury. Ringer's lactate reduced mortality by 2.33% and kidney injury by 1.41% compared to normal saline. Adding albumin to normal saline further reduced mortality by 1.20% and kidney outcomes by 0.71%. The combination of Ringer's lactate and albumin provided the greatest benefit (mortality: -3.07%, kidney injury: -3.00%). Patients with high SOFA scores, low albumin, or high lactate levels benefited more from normal saline, whereas those with low eGFR or on vasopressors were less likely to benefit from albumin. Ringer's lactate, particularly when combined with albumin, is superior to normal saline in reducing mortality and kidney injury in septic shock patients, underscoring the need for personalized fluid management based on patient-specific factors.", "authors": ["Kang Yoonjin", "Ahn Shin Young", "Kang Min Woo"], "published_date": "2025-05-25", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "探討敗血性休克治療效果與輸液策略：基於深度學習的因果推斷方法", "summary_zh": "敗血性休克病因和患者特徵多樣，需要個體化的輸液管理。本研究利用深度學習因果推斷模型，分析MIMIC-IV資料庫中13527名敗血性休克患者，比較生理食鹽水、乳酸林格氏液和白蛋白等輸液策略的效果。結果顯示，與生理食鹽水相比，乳酸林格氏液能降低2.33%的死亡率和1.41%的腎損傷風險；額外添加白蛋白可進一步降低1.20%的死亡率和0.71%的腎損傷風險。乳酸林格氏液和白蛋白聯合使用效果最佳。研究還發現，SOFA評分高、白蛋白低或乳酸高的患者從生理食鹽水中獲益更多，而eGFR低或使用升壓藥的患者則不太可能從白蛋白中獲益。因此，對於敗血性休克患者，乳酸林格氏液，特別是與白蛋白聯合使用，在降低死亡率和腎損傷方面優於生理食鹽水，強調了基於患者特定因素進行個體化輸液管理的重要性。", "applications": ["1. **急診室快速決策輔助：** 想像一下，急診室醫生面對一位敗血性休克病人，時間緊迫。這個研究的成果可以開發成一個AI輔助決策工具，醫生輸入病人的基本數據（例如：SOFA評分、白蛋白值、乳酸值等），AI就能建議最適合這位病人的輸液方案，例如優先考慮乳酸林格氏液或聯合白蛋白，提高搶救成功率。", "2. **ICU精準治療方案：** 在加護病房（ICU），醫生可以更頻繁地監測病人的生理指標。利用這個研究的知識，醫生可以根據病人病情變化，動態調整輸液策略。例如，如果發現病人腎功能開始下降，醫生可以考慮調整輸液方案，避免使用可能加重腎損傷的藥物，實現更精準的治療。", "3. **藥廠新藥開發方向：** 這個研究發現不同輸液策略對不同病人的效果不同。藥廠可以根據這些發現，開發針對特定類型敗血性休克病人的新型輸液產品，例如針對低白蛋白血症的敗血性休克病人，開發含有高濃度白蛋白的特殊輸液，提高治療效果。"], "audio": "audios/40415107.mp3", "timestamp": "2025-05-26T17:50:37.305013"}
{"query": "deep learning", "id": "40415073", "url": "https://pubmed.ncbi.nlm.nih.gov/40415073/", "title": "Differentiability of voice disorders through explainable AI.", "summary": "The voice can be affected by various types of pathology. The phoniatric medical examination is the acoustic analysis, which evaluates the characteristic parameters extracted from the vocal signal. Computer-assisted decision-making systems can help specialists to detect vocal pathologies using only the patient's voice. In this study, transfer learning techniques are used to perform the acoustic analysis. Fine-tuned OpenL3 then predicts whether or not the signals contain a pathology by classifying them under 8 different pathologies. A publicly available dataset is used with the categories Hyperkinetic dysphonia, Hypokinetic dysphonia, reflux laryngitis vocal fold nodules, prolapse, glottic insufficiency and vocal fold paralysis in addition to the Healthy class. The results obtained are very convincing. The accuracy with OpenL3, using tranfer learning, was 99.44%. In addition, explainable decision support systems (XDSS) provide an in-depth understanding of the decision-making process. Obtaining an image resulting from the averaging of all the Occlusion Sensitivity maps will enable us to understand the spatio-temporal characteristics of the disordered voices used for classification. Thanks to explainability methods, a new term, the differentiability, can be discussed to explain the black-box operation of deep networks. For purposes of rapid diagnosis and prevention, this work could provide more detail on disordered voices by enabling a promising explainable diagnosis.", "authors": ["Özcan Fatma"], "published_date": "2025-05-25", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "透過可解釋性人工智慧區分聲音障礙", "summary_zh": "這項研究利用人工智慧分析聲音，以協助醫生診斷聲音障礙。研究團隊運用轉移學習技術，讓AI能夠辨識八種不同的聲音病理，準確率高達99.44%。更重要的是，研究採用了可解釋性決策支援系統(XDSS)，讓AI的判斷過程更加透明，醫生可以理解AI是如何做出診斷的。透過分析聲音特徵，研究人員希望找到區分不同聲音障礙的關鍵要素，這有助於未來開發更快速、更精準的聲音診斷工具，實現早期預防和治療。", "applications": ["想像一下，以後只要對著手機App講幾句話，AI就能初步判斷你的聲音有沒有問題，例如聲帶長繭或發炎，提醒你及早就醫檢查。", "如果老師或客服人員長時間使用聲音，可以利用這個技術定期監測聲帶健康狀況，預防職業性的聲音損傷。", "對於中風或神經退化性疾病的患者，聲音分析可以幫助評估語言功能的恢復情況，並提供更精準的復健計畫。"], "audio": "audios/40415073.mp3", "timestamp": "2025-05-26T17:50:46.133132"}
{"query": "diabetes management", "id": "40415035", "url": "https://pubmed.ncbi.nlm.nih.gov/40415035/", "title": "Artificial pancreas: the past and the future.", "summary": "In glucose management using continuous insulin infusion, artificial pancreas systems prevent blood glucose fluctuations and severe hypoglycemia using insulin pumps and continuous glucose monitoring. Advances in both insulin pumps and continuous glucose monitoring have enabled the transition from sensor augmented pump therapy, where insulin delivery is manually adjusted, to hybrid closed-loop insulin pump therapy, which automatically adjusts basal insulin infusion. Furthermore, fully automated insulin delivery systems that adjust insulin based on variations due to meals and exercise are now possible. These systems have been primarily applied to patients with type 1 diabetes but are now expanding to all insulin-dependent patients. Wearable artificial pancreas systems measure glucose levels in subcutaneous tissue fluid, while bedside artificial pancreas systems measure glucose levels in venous blood, making them suitable for managing the highly variable blood glucose levels of perioperative and critically ill patients. Future developments are anticipated to integrate the benefits of both wearable and bedside systems.", "authors": ["Kitagawa Hiroyuki", "Munekage Masaya", "Seo Satoru", "Hanazaki Kazuhiro"], "published_date": "2025-05-25", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "人工胰臟：過去與未來", "summary_zh": "人工胰臟系統利用胰島素幫浦和連續血糖監測，有效控制血糖波動，預防嚴重低血糖。從過去需手動調整胰島素的療法，進展到現在的混合式閉環系統，能自動調整基礎胰島素劑量。更先進的全自動系統，甚至能根據飲食和運動調整胰島素。這項技術最初應用於第一型糖尿病患者，現在也擴展到所有胰島素依賴型患者。穿戴式人工胰臟監測皮下組織液的血糖，而床邊型則監測靜脈血的血糖，適用於手術前後和重症患者，能有效管理他們不穩定的血糖。未來，這兩種系統的優點有望整合。", "applications": ["想像一下，對於需要頻繁注射胰島素的糖尿病患者，這個人工胰臟就像一個貼身管家，自動監測血糖並調整胰島素劑量，讓他們不再需要 постоянно擔心血糖忽高忽低，可以更自由地享受生活。", "對於剛做完手術或正在加護病房的病人，血糖控制非常重要。床邊型人工胰臟就像一個精準的血糖控制儀器，幫助醫生穩定病人的血糖，降低感染風險，提高康復機會。", "運動愛好者有福了！有了全自動人工胰臟，它可以根據你的運動量自動調整胰島素，讓你運動時不用擔心低血糖，可以更盡情地揮灑汗水，享受運動的樂趣。"], "audio": "audios/40415035.mp3", "timestamp": "2025-05-26T17:50:55.787810"}
{"query": "artificial intelligence", "id": "40418851", "url": "https://pubmed.ncbi.nlm.nih.gov/40418851/", "title": "Beyond Benchmarks: Evaluating Generalist Medical Artificial Intelligence With Psychometrics.", "summary": "Rigorous evaluation of generalist medical artificial intelligence (GMAI) is imperative to ensure their utility and safety before implementation in health care. Current evaluation strategies rely heavily on benchmarks, which can suffer from issues with data contamination and cannot explain how GMAI might fail (lacking explanatory power) or in what circumstances (lacking predictive power). To address these limitations, we propose a new methodology to improve the quality of GMAI evaluation using construct-oriented processes. Drawing on modern psychometric techniques, we introduce approaches to construct identification and present alternative assessment formats for different domains of professional skills, knowledge, and behaviors that are essential for safe practice. We also discuss the need for human oversight in future GMAI adoption.", "authors": ["Sun Luning", "Gibbons Christopher", "Hernández-Orallo José", "Wang Xiting", "Jiang Liming", "Stillwell David", "Luo Fang", "Xie Xing"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "超越基準：以心理計量學評估通用型醫療人工智慧", "summary_zh": "通用型醫療人工智慧(GMAI)在醫療領域應用前，嚴謹的評估至關重要。現有評估方法過度依賴基準，這可能存在數據污染問題，且無法解釋GMAI可能在何處失效，或在何種情況下失效。本研究提出一種新方法，利用建構導向流程，提升GMAI評估品質。我們借鑒現代心理計量技術，引入建構識別方法，並針對專業技能、知識和行為等不同領域，提出替代性的評估形式，這些對於安全醫療實踐至關重要。我們也討論了未來採用GMAI時，人類監督的必要性。這項研究為更全面、更可靠地評估醫療AI系統提供了新方向。", "applications": ["想像一下，以後醫生看診時，AI可以像一位經驗豐富的助理，快速提供各種診斷建議和治療方案。這項研究就像是在訓練這位AI助理時，不只看它考試成績（基準測試），更要了解它在真實情境下的應變能力和判斷力，確保它能安全可靠地協助醫生。", "未來，醫療AI可以幫助偏遠地區的居民獲得更好的醫療服務。但要確保這些AI系統不會因為地區差異或數據偏差而產生錯誤判斷，就像我們需要確保AI在不同文化背景下都能準確理解病情一樣。這項研究就是在建立一套更完善的評估機制，讓AI在各種情況下都能提供公平且有效的醫療建議。", "現在很多醫院都在導入AI系統來輔助診斷，但我們必須確保這些AI系統的建議是可靠的，不會誤導醫生。這項研究就像是在為醫療AI建立一套更嚴格的品質控制標準，確保它們的決策過程透明可理解，並且能夠在人類醫生的監督下安全運行，避免醫療事故的發生。"], "audio": "audios/40418851.mp3", "timestamp": "2025-05-27T01:51:58.970356"}
{"query": "machine learning", "id": "40418796", "url": "https://pubmed.ncbi.nlm.nih.gov/40418796/", "title": "User Intent to Use DeepSeek for Health Care Purposes and Their Trust in the Large Language Model: Multinational Survey Study.", "summary": "BACKGROUND: Generative artificial intelligence (AI)-particularly large language models (LLMs)-has generated unprecedented interest in applications ranging from everyday questions and answers to health-related inquiries. However, little is known about how everyday users decide whether to trust and adopt these technologies in high-stakes contexts such as personal health.\nOBJECTIVES: This study examines how ease of use, perceived usefulness, and risk perception interact to shape user trust in and intentions to adopt DeepSeek, an emerging LLM-based platform, for health care purposes.\nMETHODS: We adapted survey items from validated technology acceptance scales to assess user perception of DeepSeek. A 12-item Likert scale questionnaire was developed and pilot-tested (n=20). It was then distributed on the web to users in India, the United Kingdom, and the United States who had used DeepSeek within the past 2 weeks. Data analysis involved descriptive frequency assessments and Partial Least Squares Structural Equation Modeling. The model assessed direct and indirect effects, including potential quadratic relationships.\nRESULTS: A total of 556 complete responses were collected, with respondents almost evenly split across India (n=184), the United Kingdom (n=185), and the United States (n=187). Regarding AI in health care, when asked whether they were comfortable with their health care provider using AI tools, 59.3% (n=330) were fine with AI use provided their doctor verified its output, and 31.5% (n=175) were enthusiastic about its use without conditions. DeepSeek was used primarily for academic and educational purposes, 50.7% (n=282) used DeepSeek as a search engine, and 47.7% (n=265) used it for health-related queries. When asked about their intent to adopt DeepSeek over other LLMs such as ChatGPT, 52.1% (n=290) were likely to switch, and 28.9% (n=161) were very likely to do so. The study revealed that trust plays a pivotal mediating role; ease of use exerts a significant indirect impact on usage intentions through trust. At the same time, perceived usefulness contributes to trust development and direct adoption. By contrast, risk perception negatively affects usage intent, emphasizing the importance of robust data governance and transparency. Significant nonlinear paths were observed for ease of use and risk, indicating threshold or plateau effects.\nCONCLUSIONS: Users are receptive to DeepSeek when it is easy to use, useful, and trustworthy. The model highlights trust as a mediator and shows nonlinear dynamics shaping AI-driven health care tool adoption. Expanding the model with mediators such as privacy and cultural differences could provide deeper insights. Longitudinal experimental designs could establish causality. Further investigation into threshold and plateau phenomena could refine our understanding of user perceptions as they become more familiar with AI-driven health care tools.", "authors": ["Choudhury Avishek", "Shahsavar Yeganeh", "Shamszare Hamid"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "使用者使用DeepSeek於醫療保健目的之意圖及其對大型語言模型的信任：跨國調查研究", "summary_zh": "這項跨國調查研究探討了使用者對於採用DeepSeek這類新型大型語言模型（LLM）於醫療保健用途的意願。研究發現，易用性、感知有用性以及風險認知會共同影響使用者對DeepSeek的信任度，進而影響其使用意願。結果顯示，如果DeepSeek易於使用、有幫助且值得信賴，使用者會更願意接受它。信任感在其中扮演關鍵的中介角色，而風險認知則會降低使用意願。此外，研究也發現易用性和風險存在非線性關係，意味著存在門檻效應。總體而言，研究強調了建立使用者對AI醫療工具信任的重要性，並建議未來研究應關注隱私、文化差異等因素，以更深入地了解使用者行為。", "applications": ["想像一下，以後生病了，不用一直跑醫院排隊，只要用DeepSeek問一下，它就能根據你的症狀提供初步的建議，就像一個24小時隨時待命的家庭醫生。", "如果醫生看診時，能用DeepSeek快速查閱最新的醫學研究和案例，就能幫助醫生做出更準確的診斷，讓病人得到更好的治療。", "對於住在偏遠地區的人來說，可能很難找到專業的醫生。有了DeepSeek，他們就可以在家裡諮詢醫療問題，獲得基本的健康建議，減少城鄉醫療資源的差距。"], "audio": "audios/40418796.mp3", "timestamp": "2025-05-27T01:52:19.026077"}
{"query": "deep learning", "id": "40418858", "url": "https://pubmed.ncbi.nlm.nih.gov/40418858/", "title": "Speech signals-based Parkinson's disease diagnosis using hybrid autoencoder-LSTM models.", "summary": "Parkinson's disease (PD) is a neurodegenerative disorder that occurs as a result of a decrease in the chemical called dopamine in the brain. There is no definitive treatment for PD, but some medications used to control symptoms in the early stages have a critical effect on the progression of the disease. Approximately 90% of patients with PD have vocal problems, and although voice disorders seen in the early stages are not apparent in the patient's speech, they can be detected by acoustic analysis. In this study, a decision support system was proposed for the diagnosis of PD utilizing the feature extraction power of autoencoder (AE) & long short-term memory (LSTM) models by using speech signals as input data. Firstly, simple (SAE), convolutional (CAE), and recurrent (RAE) AE models were created for the ablation analysis. Then, the effect of hybridization and deepening of these models with LSTM layers on the classification performance was observed. Within the scope of the study, RAE achieved the highest accuracy among the base models while CAE & LSTM hybrid model provided the highest performance among all models with 95.79% accuracy for PD diagnosis based on audio signals. It was concluded that hybridization of the AE and LSTM models significantly improved the performance of simple and convolutional AE, and deepening the network to a certain extent improves the classification performance according to the type of AE.", "authors": ["Tekindor Ayşe Nur", "Akman Aydın Eda"], "published_date": "2025-05-25", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "基於語音訊號，使用混合自編碼器-LSTM模型診斷帕金森病", "summary_zh": "帕金森病是一種由於腦部多巴胺減少引起的神经退行性疾病。早期症狀控制藥物對疾病進程有重要影響。約90%的帕金森病患者有聲音問題，早期聲音障礙雖不明顯，但可通過聲學分析檢測。本研究提出了一種決策支持系統，利用自編碼器（AE）和長短期記憶（LSTM）模型的特徵提取能力，以語音訊號作為輸入數據來診斷帕金森病。研究比較了簡單、卷積和循環自編碼器模型，並觀察了這些模型與LSTM層混合和加深對分類性能的影響。結果顯示，循環自編碼器在基礎模型中表現最佳，而卷積自編碼器與LSTM混合模型在所有模型中表現最佳，帕金森病診斷準確率達到95.79%。結論表明，自編碼器和LSTM模型的混合顯著提高了簡單和卷積自編碼器的性能，並且在一定程度上加深網路可以提高分類性能。", "applications": ["想像一下，未來我們只要對著手機講幾句話，App就能分析你的聲音，初步判斷是否有帕金森病的風險，提醒你及早尋求專業醫療協助。這就像一個隨身的健康小幫手！", "醫院可以利用這項技術，建立一個更精準的帕金森病篩檢系統。病患不需要做侵入性的檢查，只要錄一段音，就能快速評估病情，節省時間和醫療資源。", "藥廠可以利用這個模型來評估新藥的效果。透過分析病患服藥前後的語音變化，可以更客觀地了解藥物是否有效改善帕金森病的症狀。"], "audio": "audios/40418858.mp3", "timestamp": "2025-05-27T01:52:39.773331"}
{"query": "cancer treatment", "id": "40418850", "url": "https://pubmed.ncbi.nlm.nih.gov/40418850/", "title": "Multidisciplinary Oncology Education Among Postgraduate Trainees: Systematic Review.", "summary": "BACKGROUND: Understanding the roles and patient management approaches of the entire oncology team is imperative for effective communication and optimal cancer treatment. Currently, there is no standard residency or fellowship curriculum to ensure the delivery of fundamental knowledge and skills associated with oncology specialties with which trainees often collaborate.\nOBJECTIVE: This study is a systematic review that aims to evaluate the multidisciplinary oncology education in postgraduate medical training.\nMETHODS: A systematic literature search was performed using MEDLINE, Embase, Cochrane Database of Systematic Reviews, Cochrane CENTRAL, APA PsycINFO, and Education Resources Information Center in July 2021. Updates were performed in February 2023 and October 2024. Original studies reporting the effectiveness of multidisciplinary oncology training among residents and fellows were included.\nRESULTS: A total of 6991 studies were screened and 24 were included. Fifteen studies analyzed gaps in existing multidisciplinary training of residents and fellows from numerous fields, including surgical, medical, and radiation oncology; geriatrics; palliative medicine; radiology; and pathology programs. Trainees reported limited teaching and knowledge of oncology outside of their respective fields and endorsed the need for further multidisciplinary oncology training. The remaining 9 studies assessed the effectiveness of educational interventions, including tumor boards, didactic sessions, clinical rotations, and case-based learning. Trainees reported significant improvements in multidisciplinary oncology knowledge and skills following the interventions.\nCONCLUSIONS: These data suggest postgraduate medical trainees have limited formal multidisciplinary oncology training. Existing educational interventions show promising results in improving trainees' oncology knowledge and skills. There is a need for further research and the development of multidisciplinary oncology curricula for postgraduate medical training programs.", "authors": ["Tahmasebi Houman", "Ko Gary", "Lam Christine M", "Bilgen Idil", "Freeman Zachary", "Varghese Rhea", "Reel Emma", "Englesakis Marina", "Cil Tulin D"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "研究生多專科腫瘤學教育：系統性回顧", "summary_zh": "這項系統性回顧研究評估了研究生醫學訓練中的多專科腫瘤學教育。研究發現，許多領域的住院醫師和研究員在腫瘤學方面的跨領域知識和訓練不足，包括外科、內科、放射腫瘤科、老年醫學、緩和醫療、放射科和病理科。現有的教育干預措施，如腫瘤委員會、教學課程、臨床輪值和病例學習，在提高學員的多專科腫瘤學知識和技能方面顯示出有希望的結果。研究結論指出，研究生醫學訓練項目需要進一步研究和開發多專科腫瘤學課程，以提升跨領域合作和癌症治療的品質。", "applications": ["如果我是癌症病患，這個研究告訴我，醫生們正在努力加強跨領域的合作，確保我可以得到更全面的治療計畫，不會只從單一專科的角度看問題。", "對於醫學院的學生來說，這項研究顯示，未來的腫瘤學教育會更加重視跨領域的學習，讓我們能更了解不同專科在癌症治療中的角色，更好地與其他醫生合作。", "醫院管理者可以參考這項研究，設計更多跨專科的培訓課程，提升醫療團隊的整體能力，讓癌症病患獲得更好的照顧，也能減少醫療糾紛。"], "audio": "audios/40418850.mp3", "timestamp": "2025-05-27T01:52:56.961333"}
{"query": "diabetes management", "id": "40418820", "url": "https://pubmed.ncbi.nlm.nih.gov/40418820/", "title": "Effects of evening primrose oil on treating painful diabetic neuropathy: a randomized, double-blind, clinical trial.", "summary": "OBJECTIVES: Diabetic neuropathy results in chronic pain. Traditional treatments often offer limited relief, prompting the exploration of alternative therapies like Evening Primrose Oil (EPO). This study aimed to assess the efficacy of EPO in the treatment of painful diabetic neuropathy.\nMETHODS: In this interventional clinical trial, Patients were randomly assigned to three groups. Group A, consisted of 24 patients, received 1,000 mg of EPO soft gel capsules every 12 h. Group B, consisted of 21 patients, received 1,000 mg of EPO soft gel capsules daily. Group C, also with 21 patients, was divided so that half of the patients received placebo capsules daily and the other half every 12 h. After 4 weeks, patients returned, and questionnaires were completed. Statistical analysis of the data was conducted using SPSS version 25.\nRESULTS: Groups A and B showed significant reductions in visual analog scale (VAS) pain scores, with Group A achieving the most improvement (mean pre-test: 5.96; post-test: 4.63). Analysis of covariance (ANCOVA) revealed significant differences in post-intervention scores (p<0.001) for VAS and Neuropathy total symptom score-6 (NTSS-6), indicating effective interventions. Treatment A was more effective than Treatment B for reducing pain (VAS mean difference= -0.52; p=0.044) and McGill Pain Questionnaire (MPQ) scores (mean difference= -9.56; p<0.001).\nCONCLUSIONS: EPO could serve as a valuable alternative therapy for managing painful diabetic neuropathy with fewer side effects than traditional treatments. Further research is warranted to validate these results and explore EPO treatment long-term efficacy and safety.", "authors": ["Gholami Ayub", "Koulaeinejad Neda", "Rahimi Mehrali"], "published_date": "2025-05-23", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "月見草油治療糖尿病神經病變疼痛的效果：一項隨機、雙盲臨床試驗", "summary_zh": "這項研究探討月見草油（EPO）對糖尿病神經病變疼痛的療效。研究將患者隨機分為三組，分別給予不同劑量的EPO或安慰劑。結果顯示，每天兩次服用1000毫克EPO的組別，疼痛程度（VAS評分）和神經病變總症狀評分（NTSS-6）均顯著降低，且效果優於每日一次服用相同劑量的組別。研究表明，月見草油可能是一種有價值的替代療法，能有效控制糖尿病神經病變疼痛，且副作用可能比傳統治療少。未來需要更多研究來驗證這些結果，並評估長期使用EPO的療效和安全性。", "applications": ["如果家裡長輩有糖尿病，然後常常腳麻、腳痛，晚上睡不好，這個研究發現吃月見草油可能可以減輕他們的疼痛，讓他們睡得更好，生活品質也會提升。", "有些糖尿病患者對止痛藥的副作用很敏感，或是止痛效果不好，這個研究提供了一個新的選擇，可以考慮使用月見草油來舒緩神經痛，而且比較沒有止痛藥的副作用。", "如果醫療人員在照顧糖尿病神經病變的患者，可以考慮將月見草油納入輔助治療的選項，當然還是要跟醫生討論，看看患者適不適合使用。"], "audio": "audios/40418820.mp3", "timestamp": "2025-05-27T01:53:20.024623"}
{"query": "artificial intelligence", "id": "40418804", "url": "https://pubmed.ncbi.nlm.nih.gov/40418804/", "title": "Ambivalent User Needs as a Challenge and Chance for the Design of a Web-Based Intervention for Gaming Disorder: Qualitative Interview Study With Adolescents and Young Adults.", "summary": "BACKGROUND: In Germany, there are still many young people with gaming disorder (GD) who do not use or cannot access existing treatment services. Given the increasing prevalence of internet use disorders and GD, especially among young people in Germany, there is a need to provide additional low-threshold treatment options that are easily accessible anywhere. Web-based interventions (WBIs) can be used to achieve this goal.\nOBJECTIVE: The aim of this study was to explore the treatment needs of young people with GD in Germany and derive implications for the development of a self-guided WBI for GD.\nMETHODS: Using a qualitative study design, we conducted a focus group with 3 young male adults and semistructured individual interviews with 3 male adolescents. Data were analyzed using qualitative content analysis. The reporting of this study followed the COREQ (Consolidated Criteria for Reporting Qualitative Research) guidelines.\nRESULTS: Participants' expectations of web-based help in general and of a self-guided WBI for GD revealed a wide variety of sometimes conflicting user needs. For example, by analyzing participants' experiences with successful strategies, we found that external stabilizers (eg, parental control and support group meetings) were helpful in managing GD. However, with regard to a WBI, participants described it as a barrier if the WBI created \"too much pressure.\" On the other hand, \"not enough pressure\" (ie, not enough external control) was also mentioned as a barrier. The belief that gaming is rewarding and that only equally rewarding activities are successful alternatives to gaming is in tension with the fact that changing problematic gaming behavior can be stressful and not feel rewarding at all. The data also showed that, on the one hand, a WBI should be designed to be attractive (eg, by incorporating gaming elements) but that it should not be too attractive as this, in turn, could trigger GD.\nCONCLUSIONS: A self-guided WBI for GD should consider and address conflicting user needs. Ambivalence of needs in the face of coping with GD should not be seen as a problem but as a normal part of a change process and, therefore, actively integrated into the WBI concept and storyline.\nTRIAL REGISTRATION: German Clinical Trials Register DRKS00032334; https://drks.de/search/en/trial/DRKS00032334.", "authors": ["Geisler Birte Linny", "Petersen Kay Uwe", "Hanke Sara", "Schurer Simon", "Schreiber Anne", "Lämmle Christine", "Batra Anil", "Renner Tobias", "Brandhorst Isabel"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "矛盾的使用者需求：設計網路成癮網路介入措施的挑戰與機遇——青少年與年輕成人之質性訪談研究", "summary_zh": "本研究探討德國網路遊戲成癮青少年和年輕人對網路介入治療的需求。研究發現，使用者對於網路介入抱持著複雜且矛盾的期望。例如，他們需要外部支持（如家長控制和支持團體），但同時又排斥過度的壓力。他們認為遊戲本身具有吸引力，但網路介入又不能過於吸引人，以免反過來觸發成癮行為。研究結論指出，設計網路遊戲成癮的網路介入措施時，應考慮並處理這些矛盾的需求。將這些矛盾視為改變過程中的正常現象，並將其納入網路介入的設計和故事主線中，才能更有效地幫助使用者。", "applications": ["想像一下，如果你的孩子沉迷遊戲，這個研究可以幫助你設計一個既能引導孩子，又不會讓他們反感的網路戒癮計畫，就像一個溫柔的導師，而不是嚴厲的監管者。", "很多年輕人想戒掉遊戲癮，但又覺得很難。這個研究就像一份客製化的地圖，告訴設計師如何打造一個既有趣又能幫助他們擺脫遊戲的網路工具，讓戒癮不再是痛苦的掙扎，而是一場有趣的冒險。", "對於開發網路戒癮App的公司來說，這項研究提供寶貴的洞察，讓他們知道如何設計出真正符合使用者需求的產品，避免一味地強制控制，而是創造一個更人性化、更有效的解決方案。"], "audio": "audios/40418804.mp3", "timestamp": "2025-05-27T03:40:59.790015"}
{"query": "machine learning", "id": "40418791", "url": "https://pubmed.ncbi.nlm.nih.gov/40418791/", "title": "Clinician Attitudes and Perceptions of Point-of-Care Information Resources and Their Integration Into Electronic Health Records: Qualitative Interview Study.", "summary": "BACKGROUND: Electronic health records (EHRs) are widely used in health care systems across the United States to help clinicians access patient medical histories in one central location. As medical knowledge expands, clinicians are increasingly using evidence-based point-of-care information (POCI) resources to facilitate clinical decision-making in medical practices. While these tools can improve clinical outcomes, few studies have assessed clinicians' opinions on integrating them with EHRs.\nOBJECTIVE: This study aims to assess clinicians' attitudes and the perceived value of POCI resources for finding medication- and disease-related information in clinical practice and their integration with EHRs.\nMETHODS: Semistructured interviews were conducted with 10 clinicians from various roles and specialties between December 2021 and January 2022 at Brigham and Women's Hospital in Boston, Massachusetts. A content analysis approach was used to examine participants' responses and feedback on their current use of POCI resources, barriers and facilitators, mobile app use, and recommendations for improved integration.\nRESULTS: Of the 10 participants, 6 (60%) were female, 9 (90%) were aged <40 years, and 8 (80%) had ≤10 years of experience in clinical practice. While UpToDate was the most preferred disease-related information resource (n=9, 90%), preferences for medication-related resources varied, with 2 (20%) participants favoring Micromedex, 2 (20%) favoring Lexicomp, 2 (20%) favoring Brigham and Women's Hospital-specific drug administration guidelines, 2 (20%) favoring UpToDate, and 1 (10%) favoring Medscape. Most participants used their preferred tools weekly. Most clinicians preferred comprehensive POCI tools with clear, navigable layouts that eased and quickened the search for information. Features such as heavy text density, the lack of citations, and frequent log-ins to access the tool were viewed as barriers that limited content legibility, credibility, and accessibility. Access-related, tool-specific, and integration-related barriers were reported to negatively impact clinical workflow. Most (n=8, 80%) of the participants reported currently using mobile apps, reasoning that they facilitated quick and convenient searches for information; however, frequent updates, time-consuming log-ins, and high text density on smaller screens posed challenges. Most participants favored further integration of POCI resources with EHRs, with all reporting them being currently available as embedded links that launch externally. Some recommended that further integration would allow us to leverage existing POCI tool features, such as chatbots and knowledge links, as well as aspects of artificial intelligence and machine learning, such as predictive algorithms and personalized alert systems, to enhance EHR functionality.\nCONCLUSIONS: Participants favored integration to improve usability and optimize workplace efficiency by reducing the amount of time spent seeking answers to their medication- and disease-related questions. Recommendations on integration highlighted the need for stakeholder input in developing clinical decision support tools and interfaces that leverage advancements in artificial intelligence and machine learning while not compromising user experience or increasing time spent on tasks.", "authors": ["Marceau Marlika", "Dulgarian Sevan", "Cambre Jacob", "Garabedian Pamela M", "Amato Mary G", "Seger Diane L", "Volk Lynn A", "Jackson Gretchen Purcell", "Bates David W", "Rozenblum Ronen", "Syrowatka Ania"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "臨床醫師對於照護點資訊資源的態度和認知及其與電子健康紀錄整合：一項質性訪談研究", "summary_zh": "這項研究探討了臨床醫師對於在臨床實務中使用照護點資訊資源（POCI）的看法，以及將這些資源整合到電子健康紀錄（EHR）中的價值。研究團隊在波士頓Brigham and Women's Hospital訪談了10位不同職位和專科的臨床醫師。研究發現，UpToDate是最受歡迎的疾病資訊資源，而藥物資訊資源的選擇則較為分散。醫師們偏好內容全面、排版清晰的POCI工具，但認為文字過於密集、缺乏引用以及頻繁登入等問題會影響使用體驗。多數醫師使用手機App來快速搜尋資訊，但也面臨更新頻繁、登入耗時等挑戰。大家普遍支持將POCI資源與EHR進一步整合，以提升可用性、減少尋找資訊的時間，並建議利用人工智慧和機器學習技術來強化EHR的功能。", "applications": ["想像一下，如果醫生在看診時，需要的藥物資訊或疾病知識，不用再花時間翻書或上網查，而是直接在電腦系統裡就能快速找到，就像有個隨身醫療百科全書一樣，這就能幫助醫生更有效率地做出正確的診斷和治療。", "如果你今天去看醫生，醫生可以透過整合的系統，快速了解最新的治療方法和藥物資訊，這表示你接受到的醫療照護是與時俱進的，不會因為醫生太忙或資訊落後而延誤病情。", "醫院可以利用這個研究結果，設計出更好用的電子病歷系統，讓醫生更容易找到需要的資訊，減少錯誤發生的機率，最終提升整體醫療品質，讓病人得到更好的照顧。"], "audio": "audios/40418791.mp3", "timestamp": "2025-05-27T03:41:10.349412"}
{"query": "deep learning", "id": "40418716", "url": "https://pubmed.ncbi.nlm.nih.gov/40418716/", "title": "A New Approach for Calculating Texture Coefficients of Different Rocks With Image Segmentation and Image Processing Techniques.", "summary": "The texture coefficient (TC) is a critical parameter used to analyze the microstructural characteristics of rocks and predict their mechanical behavior. In recent years, various computational programs and software have been employed to estimate the TC values of rocks. However, existing methods remain insufficient and time-consuming for accurately determining rock TCs. In this study, thin-section images of 20 different igneous, metamorphic, and sedimentary rocks were acquired and segmented to calculate TC values using a novel approach. The computation process was implemented using Python-based software that integrates segmentation and image processing techniques to determine TC values. The thin-section images were segmented utilizing a deep learning-based image processing technique, and a Python-based algorithm was developed for TC calculations. The proposed method offers a unique approach to TC estimation in rocks, achieving a high segmentation accuracy (IoU = 0.97). Furthermore, with this method, the TC value of any given rock can be computed in approximately 1 min.", "authors": ["Karakaya Emre", "Kekeç Bilgehan", "Bilim Niyazi", "Adigözel Fatih V"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "利用圖像分割和圖像處理技術計算不同岩石紋理係數的新方法", "summary_zh": "本研究提出一種新的方法，利用深度學習圖像分割和Python演算法，快速準確地計算岩石的紋理係數 (TC)。紋理係數是分析岩石微觀結構和預測其力學行為的重要參數。傳統方法耗時且精度不足，本研究透過分析20種不同火成岩、變質岩和沉積岩的薄片圖像，開發出一套整合分割和圖像處理的軟體，能在約1分鐘內計算出岩石的TC值，且分割準確度高達0.97 (IoU)。此方法為岩石TC估算提供了一個獨特的途徑，大幅提升效率和準確性。", "applications": ["想像一下，我們可以用這個技術快速分析建築物使用的石材，了解它的結構強度，預測它能承受多大的地震，讓建築更安全。", "這個技術也能應用在地質探勘上，快速分析岩石樣本，幫助我們找到潛在的礦藏或石油，更有效率地利用地球資源。", "考古學家也能用它來分析古代石器或石雕，了解當時的工藝技術和石材來源，幫助我們重建古代文明的歷史。"], "audio": "audios/40418716.mp3", "timestamp": "2025-05-27T03:41:18.063559"}
{"query": "cancer treatment", "id": "40418817", "url": "https://pubmed.ncbi.nlm.nih.gov/40418817/", "title": "A Call for Action to Prevent Imposter Syndrome and Burn-Out Among Medical Oncologists.", "summary": "Burnout and imposter syndrome (IS) are commonly reported among oncologists at all career stages, irrespective of age, sex, or training level. Many professionals in the field reported feeling unsupported, highlighting the urgent need for coordinated efforts by institutions and professional organizations to strengthen the well-being infrastructure. As more oncologists consider leaving the profession or transitioning to other careers, the importance of thoughtful workforce planning and retention strategies has become increasingly apparent. Resilience, though a core trait in cancer physicians, is not sufficient. Addressing IS and burnout requires a broad cultural shift, one that fosters mentorship, implements supportive workplace policies, and prioritizes physician health. The future of oncology depends not only on scientific breakthroughs but also on the sustainability and well-being of those delivering care. Therefore, it is time to act.", "authors": ["Erul Enes"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "呼籲採取行動，預防醫療腫瘤科醫師的冒名頂替症候群與職業倦怠", "summary_zh": "醫療腫瘤科醫師普遍面臨職業倦怠和冒名頂替症候群，不分年齡、性別或訓練程度。許多醫師感到缺乏支持，機構和專業組織應立即採取協同措施，強化支持系統。越來越多腫瘤科醫師考慮離職或轉行，因此完善的人力規劃和留任策略至關重要。雖然韌性是癌症醫師的核心特質，但仍不足以應對。解決冒名頂替症候群和職業倦怠需要更廣泛的文化轉變，包括強化導師制度、實施支持性的職場政策，並優先考慮醫師的健康。腫瘤學的未來不僅取決於科學突破，更取決於提供照護者的永續性和福祉。現在是採取行動的時候了。", "applications": ["想像一下，如果醫院能更重視醫師的身心健康，提供心理諮詢和支持團體，就能減少醫師的職業倦怠，讓他們更有精力和熱情照顧病人，病人也能得到更好的醫療服務。", "如果醫學院在訓練過程中，就教導學生如何應對壓力、建立自信，並提供導師制度，就能降低未來醫師罹患冒名頂替症候群的風險，讓他們在職業生涯中更有自信地發揮所長。", "政府和醫療機構可以合作，制定更完善的醫師工作環境規範，例如更彈性的工時、更合理的薪資，以及更多進修機會，這樣就能吸引更多優秀的醫療人才投入腫瘤科，讓癌症病人有更多機會獲得及時且高品質的治療。"], "audio": "audios/40418817.mp3", "timestamp": "2025-05-27T03:41:28.286372"}
{"query": "diabetes management", "id": "40418778", "url": "https://pubmed.ncbi.nlm.nih.gov/40418778/", "title": "[MIA 2.0, Comprehensive asthma management, guidelines for Mexico].", "summary": "BACKGROUND: In 2020, a multidisciplinary group developed Integrated Asthma Management (MIA), guidelines for asthma in Mexico, based on international asthma guidelines. Since then, several concepts and treatments have been updated.\nOBJECTIVE: To create a current version of MIA, strongly based on evidence, and to add the management of severe asthma exacerbations.\nMETHODOLOGY: MIA 2.0 uses the ADAPTE method. The MIA 2.0 guideline development group consists of a core group (experts in pulmonology-allergology-methodology) and representatives of 16 institutions/societies of specialties that manage asthma. The international reference guidelines (selected with AGREE-II) were: GINA 2024, GEMA 5.4, BTS/SIGN 2024 and Australian Asthma Handbook 2021. MIA 2.0 covers diagnosis, treatment, severe asthma, exacerbations and special groups. Key clinical questions were formulated for I) diagnosis, II) treatment steps 1-4, III) severe asthma and IV) exacerbations.\nRESULTS: Based on evidence in reference guidelines, safety, cost and local reality, the core group developed responses to the clinical questions. Through a Delphi process, the MIA 2.0 development group suggested adjustments until consensus was reached.\nCONCLUSION: A document was generated with multiple figures and algorithms, about asthma management including exacerbations treatment, adjusted for Mexico broadly based among different societies that participated in its development.", "authors": ["Larenas-Linnemann Désirée E S", "Jorge A Jorge A", "Cortés-Telles Arturo", "Navarrete-Rodríguez Elsy M", "Del Río-Navarro Blanca E", "Lemus-Rangel Ricardo", "Del Río-Hidalgo Rodrigo F", "García-Ramírez Ulises N", "Soto-Ramos Mario", "Hernández-Rocha Federico I", "Muñoz-Miranda Eulogio", "Zamarrón-Reyes Iván", "Casillas-Suárez Catalina", "Alvarado-Amador Irlanda", "Jiménez-Chobillón Marcos A", "Alemán-Ortega Abril D", "Camargo-Ángeles Roberto", "Campos-Rivera Armando", "Carrillo-Alduenda José L", "Carrillo-Rodríguez Víctor M", "Cuevas-Schacht Francisco J", "Dávalos-Valenzuela Roberto", "Díaz-Jiménez Karina", "Rodríguez-Aguilera Ma de Lourdes", "Estrada-Reyes Elizabeth", "González-Tuyub Yair H", "Hidalgo-Castro Emilia M", "Juárez-Ortíz Carlos", "López-Vázquez Ma de la Luz", "Luna-Castañeda Adriana Del C", "Martínez-Aguilar Nora E", "Méndez-García Anabell D", "Moncayo-Coello Carol V", "Onuma-Takane Ernesto", "Vazquez-García Jorge", "Villarreal-de la Rosa Ma Mayela", "Zepeda-Ortega Benjamín", "Sánchez-González Andrés", "Hinojos-Gallardo Luis C", "Reyes-Herrera Adela"], "published_date": "2025-05-06", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "MIA 2.0：墨西哥氣喘綜合管理指南", "summary_zh": "墨西哥於2020年發布了氣喘綜合管理指南(MIA)，本次MIA 2.0版本旨在更新並強化該指南，使其基於最新證據，並納入嚴重氣喘惡化的管理。MIA 2.0採用ADAPTE方法，由肺臟科、過敏科專家和來自16個機構/協會的代表共同制定，參考了GINA 2024、GEMA 5.4、BTS/SIGN 2024和澳大利亞氣喘手冊2021等國際指南。MIA 2.0涵蓋診斷、治療、嚴重氣喘、惡化和特殊群體。針對診斷、治療步驟、嚴重氣喘和惡化等關鍵臨床問題，專家組根據證據、安全性、成本和當地實際情況制定了應對方案，並通過Delphi法達成共識。最終產生了一份包含多個圖表和算法的文件，內容涵蓋氣喘管理，包括惡化治療，並根據墨西哥的實際情況進行了調整，廣泛基於參與開發的不同學會。", "applications": ["情境一：小明的媽媽發現小明最近常常咳嗽、呼吸困難，尤其是運動後更明顯。透過這個新的氣喘指南，醫生可以更精準地診斷小明是否得了氣喘，並給予最適合他的治療方式，讓小明可以像其他小朋友一樣，盡情地跑跑跳跳。", "情境二：王伯伯有氣喘很多年了，最近氣喘常常發作，讓他非常不舒服。有了這個更新的氣喘指南，醫生可以更好地管理王伯伯的氣喘，避免嚴重的氣喘發作，提高王伯伯的生活品質，讓他可以安心地享受退休生活。", "情境三：李醫師在偏鄉地區看診，資源比較缺乏。這個氣喘指南考慮了墨西哥的實際情況，提供了經濟實惠又有效的治療方案。李醫師可以根據指南，即使在資源有限的情況下，也能為氣喘患者提供最好的照顧，減少他們的痛苦。"], "audio": "audios/40418778.mp3", "timestamp": "2025-05-27T03:41:41.829844"}
{"query": "artificial intelligence", "id": "40420280", "url": "https://pubmed.ncbi.nlm.nih.gov/40420280/", "title": "Enhancing patient rehabilitation outcomes: artificial intelligence-driven predictive modeling for home discharge in neurological and orthopedic conditions.", "summary": "In recent years, the fusion of the medical and computer science domains has gained significant traction in the scientific research landscape. Progress in both fields has enabled the generation of a vast amount of data used for making predictions and identifying interesting clusters and pathways. The Machine Learning (ML) model's application in the medical domain is one of the most compelling and challenging topics to explore, bridging the gap between Artificial Intelligence (AI) and healthcare. The combination of AI and medical information offers the possibility to create tools that can benefit both healthcare providers and physicians. This enables the enhancement of rehabilitation therapy and patient care. In the rehabilitation context, this work provides an alternative perspective: prediction of patients' home discharge upon completing the rehabilitation protocol. Demographic and clinical data were collected on 7282 inpatients from electronic Medical Record, each record was categorized into Neurological Patients (NP, N = 3222) or Orthopedic Patients (OP, N = 4060). To identify the most suitable machine learning model, an extensive data preprocessing phase was conducted. This process involved variables recoding, scaling, and the evaluation of different dataset balancing methods to optimize model performance. Following a thorough review and comparison of algorithms commonly employed in the clinical-rehabilitative field, the Random Over Sampling (ROS) technique, in combination with the Random Forest (RF) machine learning model, was selected. Subsequently, a comprehensive hyperparameter tuning phase was performed using a grid search approach. The optimized model achieved an average accuracy of 98% for OP and 96% for NP, based on 10-fold cross-validation applied to the balanced training set (unrealistic scenario). When tested on the unbalanced dataset (real-world condition), the RF model maintained strong generalization performance, achieving 90% accuracy for OP and 83% for NP. This work points out the increasing importance of AI in medicine, especially in the realm of personalized rehabilitation. The use of such approaches could signify a transformative shift in healthcare. The integration of machine learning not only enhances the precision of treatment but also opens new possibilities for patient-centered care, improving outcomes and quality of care for individuals undergoing rehabilitation.", "authors": ["Buscarini Leonardo", "Romano Paola", "Cocco Elena Sofia", "Damiani Carlo", "Pournajaf Sanaz", "Franceschini Marco", "Infarinato Francesco"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "提升患者復健成效：人工智慧驅動的神經與骨科疾病居家出院預測模型", "summary_zh": "近年來，醫療與電腦科學的結合日益重要。本研究利用大量醫療數據，開發機器學習模型，預測神經或骨科患者完成復健療程後是否適合返家。研究團隊收集了7282名住院病患的資料，區分為神經病患(3222人)和骨科病患(4060人)，並採用隨機森林(Random Forest)模型，經優化後，在真實世界數據集中，骨科病患的預測準確率達90%，神經病患則為83%。這項研究顯示人工智慧在醫療領域，尤其是在個人化復健方面，具有極大的潛力，能提升治療精準度，改善患者的照護品質與成效。", "applications": ["想像一下，如果醫院能用AI預測你復健後能不能回家，就能提早幫你安排好居家環境，讓你出院後生活更順利！", "如果你是保險公司，可以用這個AI模型來評估病患的復健需求，更精準地規劃保險方案，避免浪費資源。", "身為醫療器材廠商，可以利用這個AI技術開發更智慧的復健輔具，根據病患的復原狀況調整訓練計畫，讓復健效果更好！"], "audio": "audios/40420280.mp3", "timestamp": "2025-05-27T06:23:40.967562"}
{"query": "machine learning", "id": "40420260", "url": "https://pubmed.ncbi.nlm.nih.gov/40420260/", "title": "Integrating bioinformatics and machine learning to identify biomarkers of branched chain amino acid related genes in osteoarthritis.", "summary": "BACKGROUND: Branched-chain amino acids (BCAA) metabolism is significantly associated with osteoarthritis (OA), but the specific mechanism of BCAA related genes (BCAA-RGs) in OA is still unclear. Therefore, this research intended to identify potential biomarkers and mechanisms of action of BCAA-RGs in OA tissues.\nMETHODS: Differential genes were obtained from the Gene Expression Omnibus (GEO) database and intersections were taken with BCAA-RGs to identify candidate genes. The underlying mechanisms were revealed using Gene Ontology (GO) and Kyoto Encyclopedia of Genes and Genomes (KEGG). Subsequently, by combining three machine learning algorithms to identify genes with highly correlated OA features. In addition, created diagnostic maps and subject Receiver operating characteristic curves (ROCs) to assess the ability of the signature genes to diagnose OA and to predict their possible roles in molecular regulatory network axes and molecular signaling pathways.\nRESULTS: Eight candidate genes were acquired by intersecting 4,178 DEGs and 14 BCAA-RGs. Subsequently, five candidate biomarkers were obtained, namely SLC3A2, SLC7A5, SLC43A2, SLC43A1, and SLC7A7. Importantly, SLC3A2 and SLC7A5 were validated by validation set and qRT-PCR. Furthermore, the nomogram constructed by SLC3A2 and SLC7A5 exhibited excellent accuracy in predicting the incidence of OA. The enrichment results demonstrated that SLC3A2 and SLC7A5 were significantly enriched in ribosome, insulin signaling pathway, olfactory transduction, etc. Meanwhile, we also found XIST regulated SLC7A5 through hsa-miR-30e-5p, and regulated SLC3A2 through hsa-miR-7-5p.OIP5-AS1 regulated SLC7A5 and SLC3A2 through hsa-miR-7-5p. By the way, 150 drugs were identified, including Acetaminophen and Acrylamide, which exhibited simultaneous targeting of these two biomarkers.\nCONCLUSION: Based on bioinformatics, SLC3A2 and SLC7A5 were identified as biomarkers related to BCAA in OA, which may provide a new reference for the treatment and diagnosis of OA patients.", "authors": ["ZhaYang Xiao-Zhi", "Chen Yan-Xiong", "Hua Wen-Da", "Bai Zheng-Lin", "Jin Yun-Peng", "Zhao Xing-Wen", "Liu Quan-Fu", "Meng Zeng-Dong"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "整合生物資訊學與機器學習鑑定骨關節炎中支鏈胺基酸相關基因的生物標記", "summary_zh": "這項研究結合生物資訊學和機器學習，旨在找出與骨關節炎相關的支鏈胺基酸代謝基因。研究人員從公開的基因表現資料庫中篩選出差異表現基因，並與支鏈胺基酸相關基因進行比對，找到了幾個潛在的候選基因。接著，利用機器學習演算法，鎖定了五個可能的生物標記，分別是SLC3A2、SLC7A5、SLC43A2、SLC43A1和SLC7A7。其中，SLC3A2和SLC7A5經過驗證，證實它們在骨關節炎的發生中扮演重要角色。研究還發現，這兩個基因與核糖體、胰島素訊號通路等有關。此外，研究也揭露了XIST和OIP5-AS1如何透過microRNA來調控SLC7A5和SLC3A2。最後，研究還鑑定出乙醯胺酚和丙烯醯胺等150種藥物，它們能夠同時針對這兩個生物標記產生作用。這項研究為骨關節炎的診斷和治療提供了新的參考方向。", "applications": ["骨關節炎早期篩檢：透過檢測血液或關節液中SLC3A2和SLC7A5的含量，可以幫助高風險族群及早發現骨關節炎，及時介入治療，延緩疾病進程。", "個人化治療方案：根據患者的基因表現和代謝特徵，醫生可以制定更精準的治療方案，例如選擇更有效的藥物或調整生活方式，以改善骨關節炎的症狀。", "新藥開發：以SLC3A2和SLC7A5為靶點，開發新的藥物，直接針對骨關節炎的病理機制，有望提供更有效的治療方法，減輕患者的痛苦。"], "audio": "audios/40420260.mp3", "timestamp": "2025-05-27T06:23:53.557219"}
{"query": "deep learning", "id": "40420248", "url": "https://pubmed.ncbi.nlm.nih.gov/40420248/", "title": "Phenotypic study of humanized mice carrying the PAH deep intronic variant c.1199+502A>T.", "summary": "BACKGROUND: The c.1199 + 502 A > T variant of the phenylalanine hydroxylase (PAH) gene, which is the most frequently reported deep intronic variant involved in phenylketonuria (PKU), is mainly observed in patients with classical or mild PKU. Prior to this study, no mouse models of PKU featuring deep intronic variants of PAH had been reported.\nMETHODS: To phenotypically simulate the pathogenicity of this variant, we used CRISPR/Cas9 genome editing technology and homologous recombination to generate homozygous PKU model mice with a partially humanized Pah gene incorporating human PAH exons 11-12 carrying c.1199 + 502 A > T or wild-type (c.1199 + 502WT) control sequences.\nRESULTS: Humanized homozygous Pah c.1199 + 502 A > T mice exhibited a classical PKU phenotype, including a higher serum phenylalanine concentration, yellowing of the fur, and other traits. The homozygous mutant group had poorer spatial learning and spatial memory compared with the wild-type group.\nCONCLUSION: This construction of the first humanized mice carrying a deep intronic variant of PAH provides a new animal model for the pathogenesis and treatment of PKU, and may serve as a reference for future research on the pathogenicity of deep intronic variation.", "authors": ["Zhang Chuan", "Yan Yousheng", "Zhou Bingbo", "Gao Huimin", "Jin Xiaohua", "Hui Ling", "Hao Shengju", "Cao Zongfu", "Ma Xu"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "攜帶PAH深內含子變異株c.1199+502A>T的人源化小鼠的表型研究", "summary_zh": "本研究旨在建立一個新的苯丙酮尿症(PKU)動物模型。研究團隊利用CRISPR/Cas9基因編輯技術，創建了帶有PAH基因深內含子變異株c.1199+502A>T的人源化小鼠模型。這些小鼠表現出經典的PKU表型，包括血清苯丙氨酸濃度升高、毛髮變黃等。與野生型小鼠相比，突變小鼠的空間學習和記憶能力較差。此人源化小鼠模型的建立，為PKU的發病機制和治療研究提供了一個有價值的工具，並可作為未來深內含子變異致病性研究的參考。", "applications": ["1. 寶寶篩檢出苯丙酮尿症，家長很擔心。這個研究就像打造了一個跟寶寶有類似基因問題的小鼠，醫生可以利用這些小鼠來測試新的治療方法，看看哪種方法最有效，讓寶寶能健康長大。", "2. 藥廠想開發治療苯丙酮尿症的新藥，但不知道新藥效果如何。這個研究創造的小鼠，就像一個活體實驗室，藥廠可以在小鼠身上測試新藥的安全性跟療效，加速新藥開發的進程。", "3. 科學家想更深入了解苯丙酮尿症的成因，但直接研究人體太困難。這個研究創造的小鼠，可以幫助科學家在小鼠身上模擬人類的疾病狀況，更容易找到治療疾病的關鍵。"], "audio": "audios/40420248.mp3", "timestamp": "2025-05-27T06:24:04.076011"}
{"query": "cancer treatment", "id": "40420324", "url": "https://pubmed.ncbi.nlm.nih.gov/40420324/", "title": "Computed Tomographic Analysis of the Anatomical Characteristics of the Canine Prostatic Artery and Development of a Three-Dimensional Canine Prostate Cancer Model for Simulation of Prostatic Artery Embolization.", "summary": "The prognosis of prostate cancer in male dogs is considered poor to grave, and prostatic artery embolization (PAE) has been proposed as an alternative to traditional treatment options. This study analyzed the anatomical characteristics of the prostatic artery using computed tomographic (CT) angiography and developed a three-dimensional (3D)-printed prostate cancer model for PAE training. Computed tomographic images from 37 control dogs and 14 prostate cancer dogs were analyzed, with 102 pelvic sides classified into three types: the prostatic arteries originated from the internal pudendal artery in 100, an internal iliac artery in 1, and the umbilical artery in 1. Bodyweight was positively correlated with the diameters of the abdominal aorta and pelvic arteries in both groups. (p <.01). However, the normalized prostatic artery diameter was significantly larger for the prostate cancer group (p <.05). Computed tomography revealed local invasion of the bladder in 11 of the 14 dogs. Of 9 of the 11 dogs with confirmed bladder invasion, the caudal vesical, umbilical, and prostatic arteries were cancer-feeding in 9, 1, and 9, respectively. Based on the CT angiography images, a 3D-printed prostate cancer model was developed using a representative case that was close to the average value of each arterial blood vessel diameter. The model was used to simulate PAE, and successful embolization was confirmed using fluoroscopic guidance. Preprocedural CT angiography is useful for assessing the anatomical characteristics of the prostatic artery, and the 3D-printed prostate cancer model demonstrated the feasibility of PAE simulation.", "authors": ["Han Jaepung", "Jeon Sunghoon", "Kim Byungjin", "Kim Sojin", "Park Jiwoon", "Kim Uhjin", "Chang Jinhwa", "Hyun Sang-Hwan", "Chang Dongwoo", "Lee Namsoon"], "published_date": "2025-05-27", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "犬前列腺動脈解剖特徵之電腦斷層分析與前列腺動脈栓塞術三維犬前列腺癌模型之開發", "summary_zh": "本研究旨在探討犬前列腺癌的動脈栓塞治療。由於犬前列腺癌預後不佳，前列腺動脈栓塞術(PAE)成為潛在的替代療法。研究團隊利用電腦斷層血管攝影(CT angiography)分析了健康犬與罹患前列腺癌的犬隻的前列腺動脈解剖結構。結果顯示，前列腺癌犬隻的前列腺動脈直徑明顯較大，且癌細胞常侵犯膀胱，並由膀胱尾動脈、臍動脈及前列腺動脈供血。研究人員根據CT影像，建立了一個三維列印的前列腺癌模型，用於模擬PAE手術，並成功地在模型上進行了栓塞。這項研究證實，術前CT血管攝影有助於評估前列腺動脈的解剖特徵，而三維列印模型則為PAE手術的模擬提供了可行性。", "applications": ["獸醫培訓：獸醫學生或執業獸醫可以利用這個3D列印模型，練習前列腺動脈栓塞手術，就像飛行員用模擬器練習飛行一樣，能大大提升手術的熟練度和成功率。", "手術規劃：在實際為狗狗進行前列腺動脈栓塞手術前，獸醫可以先用這個模型進行模擬，預先了解血管走向和可能的困難，從而制定更完善的手術方案，降低手術風險。", "飼主溝通：獸醫可以利用這個3D模型，向寵物主人清楚地解釋前列腺癌的病情、手術方式和預期效果，讓主人更了解治療過程，做出更明智的決定。"], "audio": "audios/40420324.mp3", "timestamp": "2025-05-27T06:24:15.114189"}
{"query": "diabetes management", "id": "40420307", "url": "https://pubmed.ncbi.nlm.nih.gov/40420307/", "title": "Lipoprotein (a) levels and clinical decision-making: data from a Mexican cohort at a tertiary medical institution.", "summary": "BACKGROUND AND OBJECTIVE: Approximately 20% of the global population has a Lp(a) concentrations above 50 mg/dL (> 125nmol/L), yet many remain unaware of the associated cardiovascular risks. In Mexico, routine measurement of Lp(a) is uncommon. This study aimed to investigate the frequency of Lp(a) testing, and the clinical actions taken by physicians upon detecting elevated Lp(a) concentrations in patients at a tertiary medical institution.\nMETHODS: Using an algorithm-based screening system, we reviewed the clinical and biochemical data of patients with Lp(a) measurements from 2019 to 2024. Data were retrieved from the laboratory information system and electronic health records. Complementary assessment data were obtained from the radiology and cardiology departments.\nRESULTS: Of the 150,083 individuals evaluated at the institution, only 830 (0.5%) underwent Lp(a) testing, with testing rates increasing from 0.037% in 2019 to 0.24% in 2023. Elevated Lp(a) concentrations (> 50 mg/dL) were found in 21% of patients, and 2.2% had concentrations > 180 mg/dL. Patients with elevated Lp(a) had significantly higher rates of atherosclerotic cardiovascular disease (ASCVD) (p < 0.001) and familial hypercholesterolemia (p < 0.004) than those with lower Lp(a) levels. Interestingly, diabetes prevalence was higher in those with Lp(a) < 4 mg/dL (51.5% vs. 33.4%, p < 0.001). Despite the cardiovascular risk, only 26% of patients with elevated Lp(a) levels received interventions to modify risk factors.\nCONCLUSIONS: Lp(a) testing was infrequent in a tertiary medical setting. Clinical interventions to modify cardiovascular risk factors were insufficient among patients with elevated Lp(a). These findings highlight the need for greater awareness among healthcare providers and the development of comprehensive screening and management algorithms to mitigate Lp(a) -related cardiovascular risk.", "authors": ["Cruz-Bautista Ivette", "Flores-Jurado Yuscely", "Roa-Álvarez Guillermo", "Salas-Aldana Mariana", "Elías-Lopez Daniel Benjamin", "Hernández-Franco Ricardo Federico", "Rosales-Uvera Sandra", "Vargas-Vázquez Arsenio", "Valdez-Echeverría Raymundo", "Luna Del Villar Velasco Sonia", "Muñoz-Hernández Liliana", "Mehta Roopa", "Morales-Esponda Mario", "Aguilar-Panduro Misael", "Chan-Puga Guillermo", "Mota Adrián Soto", "Aguilar-Salinas Carlos Alberto"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "脂蛋白(a)水平與臨床決策：來自墨西哥一家三級醫療機構的數據", "summary_zh": "這項研究調查了墨西哥一家三級醫療機構中，脂蛋白(a) [Lp(a)] 的檢測頻率以及醫生在發現患者Lp(a)升高後採取的臨床措施。研究發現，在超過15萬名受評估者中，僅有0.5%接受了Lp(a)檢測，且Lp(a)升高（>50 mg/dL）的患者佔21%。這些患者罹患動脈粥樣硬化性心血管疾病(ASCVD)和家族性高膽固醇血症的比例顯著較高。然而，僅有26%的Lp(a)升高患者接受了風險因子修正的干預措施。研究結論強調，醫療保健提供者需要更加關注Lp(a)，並開發全面的篩檢和管理流程，以降低Lp(a)相關的心血管風險。", "applications": ["情境一：假設您有心血管疾病的家族病史，透過這項研究，醫生可能會建議您檢測Lp(a)水平，以便更早地評估您的心血管風險，並採取更積極的預防措施，例如調整飲食或使用藥物。", "情境二：如果您是一位糖尿病患者，而且同時有心血管疾病的風險，醫生可能會考慮檢測您的Lp(a)水平，因為研究顯示Lp(a)與糖尿病之間存在關聯。這有助於更全面地了解您的整體健康狀況，並制定更精確的治療方案。", "情境三：這項研究提醒我們，即使您沒有明顯的健康問題，定期健康檢查也可能包括Lp(a)檢測，特別是當您有其他心血管風險因素時。早期發現Lp(a)水平升高，可以幫助您及早採取行動，降低未來罹患心血管疾病的風險。"], "audio": "audios/40420307.mp3", "timestamp": "2025-05-27T06:24:30.212811"}
{"query": "artificial intelligence", "id": "40420216", "url": "https://pubmed.ncbi.nlm.nih.gov/40420216/", "title": "Advances in brain-targeted delivery strategies and natural product-mediated enhancement of blood-brain barrier permeability.", "summary": "The blood-brain barrier (BBB) represents a formidable challenge in the treatment of neurological disorders, as it restricts the passage of most therapeutic agents into the central nervous system (CNS). Research in brain-targeted delivery strategies and explore in natural products for BBB modulation have opened new avenues for effective CNS drug delivery. This review highlights the latest developments in molecular-based delivery systems, cell-based approaches, physical techniques, toxicity concerns, clinical trials and artificial intelligence (AI) -driven modeling for brain-targeted drug delivery. Additionally, it examines the role of natural products, particularly aromatic resuscitation medicines, in enhancing BBB permeability through modulating tight junction proteins and inhibiting efflux transporters. It is emphasized that the integration of natural products with modern drug delivery systems offers promising opportunities for the development of novel brain-targeted therapies. However, challenges related to the complexity and variety of natural product compositions must be addressed to fully realize their potential. This review underscores the importance of continued research into the molecular mechanisms underlying BBB modulation and natural product-mediated nano-delivery strategies for CNS disorders.", "authors": ["Liu Suyi", "Jin Xingyue", "Ge Yuanyuan", "Dong Junlin", "Liu Xinyue", "Pei Xiao", "Wang Ping", "Wang Bing", "Chang Yanxu", "Yu Xie-An"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "腦部靶向遞送策略的進展與天然產物介導的血腦屏障通透性增強", "summary_zh": "血腦屏障是治療神經系統疾病的一大挑戰，它阻礙了大多數藥物進入中樞神經系統。本研究綜述了腦部靶向遞送策略的最新進展，包括分子遞送系統、細胞方法、物理技術以及人工智慧建模。同時，探討了天然產物，特別是芳香甦醒藥物，如何通過調節緊密連接蛋白和抑制外排轉運蛋白來增強血腦屏障的通透性。將天然產物與現代藥物遞送系統結合，為開發新型腦部靶向治療提供了有希望的機會。然而，天然產物成分的複雜性和多樣性帶來的挑戰仍需克服。本研究強調了持續研究血腦屏障調節的分子機制以及天然產物介導的奈米遞送策略對於治療中樞神經系統疾病的重要性。", "applications": ["假設阿茲海默症患者因為血腦屏障的阻礙，藥物難以進入腦部發揮作用。這項研究有助於開發新的藥物傳輸技術，讓藥物更容易穿過血腦屏障，更有效地治療阿茲海默症。", "中風後，腦部組織受損，需要藥物修復。如果能利用這項研究的技術，將藥物精準地送到受損的腦部區域，就能加速患者的康復。", "有些腦部腫瘤的化療藥物很難穿透血腦屏障，導致治療效果不佳。這項研究可以幫助我們找到方法，讓化療藥物更有效地進入腫瘤細胞，提高治療成功率。"], "audio": "audios/40420216.mp3", "timestamp": "2025-05-27T09:17:22.719361"}
{"query": "machine learning", "id": "40420244", "url": "https://pubmed.ncbi.nlm.nih.gov/40420244/", "title": "Personalized dose reduction strategies for biologic disease-modifying antirheumatic drugs for treating axial spondyloarthritis: a clinical and economic evaluation with predictive modeling.", "summary": "BACKGROUND: Axial spondyloarthritis (AS) is a chronic inflammatory disease that significantly affects quality of life and imposes a high economic burden on patients due to the cost of biologic disease-modifying antirheumatic drugs (bDMARDs). Dose reduction strategies for bDMARDs may offer a feasible approach to maintaining clinical efficacy while reducing costs. This study aimed to evaluate the clinical effectiveness and cost-efficiency of bDMARD dose reduction in patients with AS and apply machine learning to identify key factors influencing disease control.\nMETHODS: This 12-month prospective study, 368 AS patients receiving ≥ 3 months of full-dose bDMARDs were included. Among 215 initial responders (ASDAS < 2.1), 146 underwent dose reduction while 69 continued full-dose therapy. Clinical outcomes such as C-reactive protein (CRP) levels, the Bath ankylosing spondylitis disease activity index (BASDAI) and ankylosing spondylitis disease activity score (ASDAS) were assessed, along with cost effectiveness using incremental cost effectiveness ratios (ICER). Random forest models were developed to predict the achievement of inactive disease (ASDAS < 1.3) and to identify key predictors.\nRESULTS: The dose reduction group demonstrated significantly greater improvements in CRP (-4.05 vs. +2.83 mg/L, p < 0.001), BASDAI (-3.00 vs. +0.89, p < 0.001), and ASDAS (-1.42 vs. +0.09, p < 0.001) compared to the full dose group. A greater proportion of patients in the reduced dose group achieved ASDAS < 1.3 at 12 months (93.2% vs. 33.3%, p < 0.001), with a shorter median time to response (4.20 vs. 4.70 months, p < 0.001). The ICER for achieving ASDAS < 1.3 was favorable (-$6,209.78; 95% CI:-$9,048.35 to-$4,015.78), supporting the cost-effectiveness of dose reduction. A random forest model identified reduced dose strategy, baseline ASDAS, BASDAI, treatment duration, and CRP as key predictors of ASDAS < 1.3, achieving an AUC of 0.845 and F1-score of 0.774.\nCONCLUSIONS: In this cohort, bDMARD dose reduction was associated with preserved clinical outcomes and lower costs, suggesting it may be a viable strategy for selected patients under close clinical supervision. Predictive modeling provided actionable insights to optimize personalized treatment strategies, balancing efficacy and economic sustainability. These findings support further evaluation of dose reduction strategies, especially in resource-limited settings, to inform potential integration into routine practice.", "authors": ["Binh Bui Hai", "Phuong Nguyen Thi Thu", "Hang Vu Thi Thanh", "Nhan Ngo Thi Thuc", "Hoa Nguyen Thi Nhu", "Van Dung Hoang"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "僵直性脊椎炎生物製劑減量策略的個人化方案：結合預測模型的臨床與經濟評估", "summary_zh": "這項研究探討僵直性脊椎炎患者使用生物製劑後，減量策略的臨床效果與成本效益。研究追蹤368位患者一年，發現對藥物有反應的患者中，減少劑量組在疾病控制指標（ASDAS）、發炎指標（CRP）和生活品質指標（BASDAI）方面，改善幅度甚至優於維持原劑量組。更重要的是，減量組達到疾病不活躍狀態的比例更高，且治療反應時間更短，同時還降低了醫療成本。研究利用機器學習，找出影響疾病控制的關鍵因素，例如初始疾病嚴重程度、治療時間等，藉此建立個人化的減量方案預測模型。結果顯示，減量策略在嚴密監控下，能維持臨床效果並降低成本，為資源有限的環境提供可行方案。", "applications": ["如果你的家人或朋友患有僵直性脊椎炎，而且使用生物製劑治療後病情穩定，可以跟醫生討論是否能嘗試減低藥物劑量。這樣不但可能可以維持病情穩定，還可以省下不少醫療費用。", "假設健保資源有限，這項研究顯示，透過精準的劑量調整，可以讓更多僵直性脊椎炎患者獲得治療，同時降低整體醫療支出，把資源用在刀口上。", "如果你是藥廠的研發人員，可以利用這項研究的預測模型，開發更個人化的治療方案，幫助醫生為患者找到最適合的藥物劑量，達到最佳的治療效果。"], "audio": "audios/40420244.mp3", "timestamp": "2025-05-27T09:17:33.496350"}
{"query": "deep learning", "id": "40420214", "url": "https://pubmed.ncbi.nlm.nih.gov/40420214/", "title": "An advanced deep learning method for pepper diseases and pests detection.", "summary": "Despite the significant progress in deep learning-based object detection, existing models struggle to perform optimally in complex agricultural environments. To address these challenges, this study introduces YOLO-Pepper, an enhanced model designed specifically for greenhouse pepper disease and pest detection, overcoming three key obstacles: small target recognition, multi-scale feature extraction under occlusion, and real-time processing demands. Built upon YOLOv10n, YOLO-Pepper incorporates four major innovations: (1) an Adaptive Multi-Scale Feature Extraction (AMSFE) module that improves feature capture through multi-branch convolutions; (2) a Dynamic Feature Pyramid Network (DFPN) enabling context-aware feature fusion; (3) a specialized Small Detection Head (SDH) tailored for minute targets; and (4) an Inner-CIoU loss function that enhances localization accuracy by 18% compared to standard CIoU. Evaluated on a diverse dataset of 8046 annotated images, YOLO-Pepper achieves state-of-the-art performance, with 94.26% mAP@0.5 at 115.26 FPS, marking an 11.88 percentage point improvement over YOLOv10n (82.38% mAP@0.5) while maintaining a lightweight structure (2.51 M parameters, 5.15 MB model size) optimized for edge deployment. Comparative experiments highlight YOLO-Pepper's superiority over nine benchmark models, particularly in detecting small and occluded targets. By addressing computational inefficiencies and refining small object detection capabilities, YOLO-Pepper provides robust technical support for intelligent agricultural monitoring systems, making it a highly effective tool for early disease detection and integrated pest management in commercial greenhouse operations.", "authors": ["Wang Xuewei", "Liu Jun", "Chen Qian"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "一種用於辣椒病蟲害檢測的先進深度學習方法", "summary_zh": "本研究提出一種名為YOLO-Pepper的改良模型，專門用於溫室辣椒病蟲害檢測，旨在克服小目標識別、遮蔽情況下的多尺度特徵提取以及即時處理需求等挑戰。YOLO-Pepper基於YOLOv10n，整合了自適應多尺度特徵提取模組、動態特徵金字塔網路和小目標檢測頭等創新技術。實驗結果顯示，YOLO-Pepper在檢測精度上超越其他模型，達到94.26%的mAP@0.5，速度為115.26 FPS。相較於YOLOv10n，精度提升了11.88%，同時保持了輕量化結構，非常適合在邊緣設備上部署。YOLO-Pepper為智慧農業監測系統提供強大的技術支援，是商業溫室早期病害檢測和綜合蟲害管理的有效工具。", "applications": ["想像一下，農民伯伯只要用手機對著辣椒植株拍照，AI就能立即判斷是否有病蟲害，並提供防治建議，省時省力，還能減少農藥的使用。", "透過在溫室中安裝攝影機，並運用這項AI技術，可以24小時監控辣椒的生長狀況，及早發現病蟲害，避免大規模爆發，確保收成。", "這項技術也能應用於無人機，讓無人機在田間巡邏，快速掃描大面積的辣椒田，找出潛在的問題，提升農業管理的效率。"], "audio": "audios/40420214.mp3", "timestamp": "2025-05-27T09:17:44.046445"}
{"query": "cancer treatment", "id": "40420317", "url": "https://pubmed.ncbi.nlm.nih.gov/40420317/", "title": "DNA repair and the contribution to chemotherapy resistance.", "summary": "The DNA damage response comprises a set of imperfect pathways that maintain cell survival following exposure to DNA damaging agents. Cancers frequently exhibit DNA repair pathway alterations that contribute to their intrinsic genome instability. This, in part, facilitates a therapeutic window for many chemotherapeutic agents whose mechanisms of action often converge at the generation of a double-strand DNA break. The development of therapy resistance occurs through countless molecular mechanisms that promote tolerance to DNA damage, often by preventing break formation or increasing repair capacity. This review broadly discusses the DNA damaging mechanisms of action for different classes of chemotherapeutics, how avoidance and repair of double-strand breaks can promote resistance, and strategic directions for counteracting therapy resistance.", "authors": ["Nesic Ksenija", "Parker Phoebe", "Swisher Elizabeth M", "Krais John J"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "DNA修復與化學治療抗藥性的關聯", "summary_zh": "癌細胞常常利用DNA修復機制來抵抗化學治療。許多化療藥物的作用原理是破壞癌細胞的DNA，但癌細胞會發展出各種方法來避免或修復這些損傷，進而產生抗藥性。這篇研究綜述探討了不同化療藥物如何破壞DNA，以及癌細胞如何透過避免或修復DNA雙鏈斷裂來產生抗藥性。研究也討論了如何應對這種抗藥性，為開發更有效的癌症治療策略提供方向。簡單來說，這研究想了解癌細胞如何修復被化療藥物破壞的DNA，從而找到阻止癌細胞修復、提高化療效果的新方法。", "applications": ["如果我們能找到方法抑制癌細胞的DNA修復能力，就能讓化療藥物更容易殺死癌細胞，提升治療效果，就像給癌細胞的防禦系統開了一個漏洞。", "這項研究有助於開發新的藥物，專門針對癌細胞的DNA修復機制下手，就像是專門破壞癌細胞的弱點，讓它們更容易被消滅。", "透過了解不同癌細胞的DNA修復方式，我們可以為患者選擇更有效的化療方案，避免使用對特定癌細胞已經產生抗藥性的藥物，這就像是為每個患者量身定制治療方案。"], "audio": "audios/40420317.mp3", "timestamp": "2025-05-27T09:17:52.397090"}
{"query": "diabetes management", "id": "40420256", "url": "https://pubmed.ncbi.nlm.nih.gov/40420256/", "title": "Construction and validation of a risk prediction model for hypoglycemia in patients with gestational diabetes mellitus.", "summary": "OBJECTIVE: We explored the prevalence and determinants of hypoglycemia in patients with gestational diabetes mellitus (GDM), and we developed and validated a nomogram prediction model.\nMETHODS: We extracted data from the clinical records of 475 patients with GDM attending the tertiary class A specialized hospital in Zhuhai City between December 2021 and June 2023 for a modeling group, and we used data of another cohort of 204 GDM cases for a validation group. We conducted a logistic regression analysis to identify factors associated with hypoglycemia in patients with GDM and generated a risk prediction model presented as a nomogram. The model was validated using data from the patients in the validation group.\nRESULTS: The prevalence of hypoglycemia in the study population was 25.5%. Our risk prediction model incorporated four predictors, including a fasting oral glucose tolerance test (OGTT) value, the number of fetuses, the presence or absence of intrahepatic cholestasis of pregnancy (ICP), and the blood glucose level self-monitoring frequency. The area under the receiver operating characteristic (ROC) curve was 0.786 for the modeling set and 0.742 for the validation set. The Brier score was 0.155, and the calibration slope was 0.750, demonstrating satisfactory clinical usefulness of the model. Moreover, a decision curve analysis further supported our model's clinical relevance.\nCONCLUSION: The prevalence of hypoglycemia in patients with GDM is considerable. Our nomogram prediction model demonstrated good performance for identifying high-risk individuals. The model could serve as a valuable tool for screening and managing hypoglycemia among patients with GDM.", "authors": ["Yang Jie-Mei", "Wang Li-Zhi", "Zhao Xiang-Feng", "Ye Qian-Cheng", "Wan Cui", "Li Xiu-Zhen", "Huang Rui-Fen", "Peng Rong-Rong", "Liu Cai-Xia"], "published_date": "2025-05-26", "journal": "期刊需擴展 EFetch 解析", "doi": "DOI 需擴展 EFetch 解析", "source": "PubMed", "title_zh": "妊娠糖尿病患者低血糖風險預測模型的構建與驗證", "summary_zh": "本研究旨在探討妊娠糖尿病（GDM）患者低血糖的發生率和影響因素，並建立一個風險預測模型。研究分析了近700名妊娠糖尿病患者的臨床資料，發現低血糖的發生率為25.5%。研究團隊利用空腹口服葡萄糖耐量試驗（OGTT）值、胎兒數量、妊娠期肝內膽汁淤積症（ICP）有無以及血糖自我監測頻率等四個預測因子，構建了一個列線圖風險預測模型。該模型在驗證集中也表現出良好的預測能力，AUC分別為0.786和0.742。此模型有助於識別妊娠糖尿病患者中發生低血糖的高風險人群，為臨床篩查和管理提供有價值的工具。", "applications": ["1. 懷孕的糖媽媽（妊娠糖尿病患者）可以透過這個模型，提早知道自己是不是容易發生低血糖的高風險群，提早預防，避免不舒服或危險。", "2. 醫生可以使用這個模型，更精準地判斷哪些妊娠糖尿病患者需要特別注意血糖控制，給予更個人化的照護計畫。", "3. 醫院或診所可以利用這個模型，設計一套更有效的妊娠糖尿病照護流程，把資源放在真正需要的人身上，提升照護品質。"], "audio": "audios/40420256.mp3", "timestamp": "2025-05-27T09:18:01.093676"}
